{"Above-board": "Honest and open. \"I don't think you're being totally above-board with me.\"", "Aces in their places!": "When someone shouts this out, everyone runs to their station and leverages their core competency.Suggested by EC.", "Acluistic": "Completely clueless.", "Across the piece": "Affecting an entire project or organization. \"We're aiming for efficiency improvements across the piece.\"Suggested by Clive N.", "Action": "To undertake a given task; to put into practice. \"Don't bother me while I'm actioning my deliverables.\"Suggested by Ryan.", "Action item": "A short term goal that requires a defined measure of work to complete. Basically a dynamic, proactive version of your to do list.", "Actionable": "Originally a legal word referring to anything that affords grounds for a lawsuit. In business speak, it's anything on which action can be taken.", "Address": "Used as a replacement for 'do', 'tackle', or 'complete', this word nicely avoids making a commitment to which the speaker can be held accountable. \"I will address all of your concerns in the upcoming weeks.\"Suggested by Russel H.", "Adhocracy": "A minimally structured business where teams are formed as they are needed to address specific problems.", "Admin": "Political correctness beat brevity when Secretary became Administrative Assistant. Brevity is back. \"Get on the horn with my Admin.\"", "Administrivia": "A term that encompasses all the trivial tasks that management is far too qualified to suffer through.", "Adoption process": "The customer's steps along the path from cautious cynic to submissive consumer of your product.", "Aggressive mediocrity": "A conscious effort to ensure that the bare minimum, and nothing more, is achieved.Suggested by SM Trkula", "Agreeance": "A fancier way of saying agreement. \"Are we in agreeance?\"", "Air it out": "To discuss an issue openly. \"Let's get the team together and air it out this aft.\"", "Al Desko": "Describes any meal eaten at an office desk (you have our sympathies if it's dinner). \"I slept in so I'm having breakfast Al Desko.\"", "ALAP": "As Late As Possible. Describes meeting a deadline at the last possible moment in order to avoid receiving additional work. \"I finished it last week, but I'm going to submit it ALAP.\"Suggested by JC.", "Alignment": "Consensus. \"Can we align on lunch orders?\"Suggested by Josh", "All-hands meeting": "A mandatory meeting for all employees. \"Bob called an all-hands this afternoon. Not a good sign when he's willing to freeze the whole department for an hour.\"", "Alpha geek": "The head of your company's IT department.", "Alpha pup": "Trendsetting young people. Important targets for marketing to this age group. \"Get six alpha pups in here for a focus group.\"", "Amped": "Having a large amount of excitement and energy. \"I'm so amped about this new product line.\"", "Anacronym": "An acronym that is so old, no one remembers the original phrase. Examples include RADAR, ASCII, and SNAFU.", "Anecgloat": "A story designed to make the speaker look good. May be partly fictional.", "Animal spirits": "The irrational optimism that drives people to risk their life savings on a half-baked start-up idea.", "Anointed": "An employee that can't seem to do anything wrong in the eyes of management.", "Anonymize": "To make anonymous.", "Anticipointment": "The feeling that something didn't live up to its hype.", "Appetite": "Level of interest. \"Don't spend another minute on this till you sample consumer appetite.\"Suggested by Otis", "Apple polish": "To suck-up, flatter.", "Armchair general": "Someone who speaks critically, but has no experience in the field in question.", "Around": "Replaces 'about' with a softer, tangential approach. \"We need to dialog around your choice of work attire.\"Suggested by Corinne F.", "Arrows to fire": "Points to use in an argument. \"Now if you don't have any more arrows to fire, I think we're finished here.\"", "Ask": "Used when the word 'request' is not quite cool enough. \"Where do we stand on the latest client ask?\"Suggested by John C.", "Assignment capsule": "A clearly defined job description or task. \"Stop arguing about objectives and start handing out assignment capsules.\"", "Assmosis": "The apparent absorption of success that comes from sucking up.", "At the end of the day": "The speaker would like you to know that he has a profound understanding about what is important and what is not.Suggested by Tom O.", "At this juncture": "Now. \"We're not prepared to go public at this juncture.\"", "Availability": "A convenient way of separating the individual from the ability to manage her own time. \"I'd love to come, but I'm not sure about my availability, grandma.\"Suggested by Sam K.", "B-school": "Business school. \"We were tight back in b-school.\"", "Babylonian orgy": "A boring conference out of town. Only applicable if the participant won't enjoy a single minute of the time away. \"Tim's off at some Babylonian orgy, so don't expect him back till Monday.\"Suggested by PJ S.", "Back door": "Unethical or dishonest.", "Back-of-the-envelope": "Anything completed in a quick, casual manner. Most often references informal calculations made by engineering and finance types.", "Backburner": "The act of deprioritizing, as if the noun weren't bad enough. \"Let's backburner that salary review until your next annual.\"Suggested by Chris K.", "Bacon job": "A project with no shortage of volunteers; a plum position.", "Bad paper": "A payment made in worthless currency (cash or check).", "Bag of snakes": "A business situation with many unexpected problems.", "Bait and switch": "To advertise low priced items that aren't actually available.", "Bake-off": "A side-by-side comparison of two products. \"Have you done a bake-off between the finalists?\"Suggested by Dave B.", "Baked cake": "A completed project. \"Don't sit there and tell me this cake is fully baked.\"Suggested by Rob S.", "Baked-in": "Included. \"Those options are already baked in with this model.\"", "Ballpark": "To make an estimate. \"Can you ballpark the cost per unit for me?\"", "Balls in the air": "Number of ongoing tasks. Used when feeling maxed out like a busy juggler. \"Let's meet again when I have fewer balls in the air.\"Suggested by Nobby J.", "Band-aid": "To apply a trivial solution to a problem. \"We'll band-aid the situation for now.\"", "Bandwidth": "The physical and mental limit of your working ability. \"I don't have the bandwidth for another project right now.\"", "Bang for the buck": "The return on invested money.", "Bangalored": "Having been fired after your position was transferred to India. \"Last month they bangalored our entire tech support department.\"", "Bankroll": "To finance. \"We can't afford to bankroll any more high-risk R&D.\"", "Banner year": "The best year in history for a given firm. Most likely, you're not having one of these.", "Barnburner": "An exciting situation.", "Base-tending": "To guard one's assets.", "Baseline": "To establish a minimum standard of knowledge for all employees. \"Baseline the procedure and samepage your department.\"Suggested by Amy K.", "Bat a thousand": "A baseball term meaning a 100% success rate.", "Batting average": "The percentage of time that someone or something is successful. \"We need to bring up our batting average in the overseas market.\"", "Battle rhythm": "A logistical plan. \"We're not leaving this conference room until we lock in a battle rhythm on the project.\"Suggested by Dan.", "Bean-counter": "A derogatory term for an accountant. \"The bean-counters are coming in for another audit next week.\"", "Beat the bushes": "Marketing to unconventional or rural areas.", "Beauty contest": "A competitive pitching situation. \"Bring in the next firm; I wanna wrap up this beauty contest before my 4 o'clock tee off.\"Suggested by Crazy Renee.", "Beef up": "To make stronger.", "Behind the eight ball": "In a difficult position.", "Bell": "A phone call. \"Give us a bell before you leave work today.\"Suggested by Vicki D.", "Bell ringer": "A door to door salesman.", "Belts and suspenders": "Proceeding with an overabundance of caution. \"Make sure we're belts and suspenders before those quotes go out.\"Suggested by Crazy Renee.", "Bespoke": "Custom or made-to-order. If you're not making a suit, I don't want to hear you say this word. \"We deliver a truly bespoke accounting experience.\"", "Best endeavors": "A promise of effort, but not results. \"…now let me assure you that we're pushing forward, best endeavors.\"Suggested by Rockett Man", "Best in breed": "A claim of superior quality relative to the competition. \"Go with us and you're going best in breed.\"", "Best practices": "Procedures and policies that have shown to be the most effective.", "Betamaxed": "When a product has been overtaken by an inferior, but well marketed alternative.", "Bifurcate": "An overly complex word that HR uses when splitting your position into two separate jobs. Feel free to reapply for either of them.Suggested by JPT", "Big enchilada": "An important person within an organization.", "Big learn": "The process of gaining skills that are difficult to master. \"We know things didn't go well, but you have to remember that it's been a big learn for all of us.\"Suggested by Russell H.", "Binary answer": "A yes or no response. \"Stop dancing around the question and give me a binary answer.\"Suggested by JP.", "Bio break": "A short pause during a meeting to give participants a chance to use the restroom. Suggestion: Just say, \"Let's take a ten minute break.\" I don't need to think about why Joan is getting squirmy.Suggested by bk", "Biome": "Environment or market. \"We just can't justify full-time hires in today's regulatory biome.\"", "Birdtable": "To meet and discuss an issue before assigning tasks. \"We'll birdtable the new schedule tomorrow.\"Suggested by Steve S.", "Black box": "New and unfamiliar technology about which uninformed decisions are often made.", "Black sky thinking": "One step beyond blue sky thinking. For those who will not abide any limitations on their flights of fancy.Suggested by Mark.", "Blackberry Heisman": "A dismissive gesture typically performed by pompous executives. The subject fields a call in one hand while holding up the symbolic \"stiff arm\" with the other.", "Blamestorming": "Meeting to discuss a failure and find a scapegoat.", "Blast of leadership": "When a company that prides itself on employee self-esteem and a non-threatening PC atmosphere must urgently adopt an authoritarian leadership style. \"You coddled the union and grievances doubled... it's time for me to step in and deliver a blast of leadership.\"Suggested by Chris K.", "Bleed": "To extract a large sum of money from an organization or individual.", "Bleeding-edge": "Something even more current than the 'cutting-edge'. Reserved for only the most novel (or hyped) technologies.", "Blessed": "Approved and supported by company leadership. \"Don't commit another dollar till this is blessed by the corner office.\"", "Bloatation": "Filling non-essential positions instead of core staff. Usually occurs just before bankruptcy.", "Bloombergsmanship": "The art of using Bloomberg's signature financial news terminal so well that it makes up for a total lack of experience in finance.", "Blow by blow": "To cover every single detail when giving a report.", "Blow hot and cold": "To frequently change one's mind.", "Blow-in": "Advertising materials inserted between the pages of a magazine that you'll spend 10 minutes removing before it's readable.", "Blue money": "Funds spent quickly and recklessly.Suggested by Yuri", "Blue ocean": "A metaphor for the wider and deeper potential of a market that is not yet explored. \"I look at the sales opportunities in front of you clowns, and all I see is blue, blue ocean.\"Suggested by Indranil.", "Blue-ocean opportunity": "A promising option that might not be foreseen by the competition. \"Blue-ocean opportunity baby, we're talking uncharted waters here.\"Suggested by Jeremy.", "Blue-sky thinking": "A thought exercise where any possibility is considered.Suggested by Patti", "BOHICA": "Bend Over Here It Comes Again.", "Boiler room": "A sales firm with questionable practices.", "Boilerplate": "Standard legal wording used company or industry-wide. Since no one really reads it, this is a great place to be sneaky.", "Boiling the frog": "The art of managing change so smoothly that it goes unnoticed. From the overused, possibly bogus cliché claiming that frogs will jump directly out of boiling water, but will happily perish when heated slowly.Suggested by Jeff I.", "Boiling the ocean": "Attempting to do something with too broad a scope. This is generally in reference to a project or initiative to avoid. \"The client is living a pipe dream; when are they going to stop trying to boil the ocean?\"Suggested by w3.", "Book the goods": "A really slick way of saying 'place an order.' \"Make sure you book the goods before you take off this afternoon.\"", "Boondoggle": "An unethical use of public money.", "Boot camp": "A company training program.", "Boots on the ground": "An overly dramatic way to refer to employees sent to work at an off-site location.", "Bootstrap": "To start a company with little capital and no outside investment.", "Bottom fishing": "Purchasing stocks that have a very low value.", "Bottom line it": "To summarize. \"I don't have time to read your progress report. Can you bottom line it for me?\"Suggested by Linda", "Bounce": "To be removed forcefully, fired.", "Bouncebackability": "The ability to reverse a losing situation and then succeed.Suggested by Paul G.", "Bow wave": "The initial effects caused by upper management changes. \"The bow wave might hit them a little hard, but they'll get past it.\"Suggested by Guy from Melbourne.", "Brain dump": "To extract the knowledge of an expert employee for the benefit of others.", "Brand terrorist": "An employee who is undermining the organization.", "Brandatories": "All of the branding elements that must be included in a given ad or campaign. \"Make sure the brandatories are in place before the shoot begins.\"Suggested by Andy B.", "Brass tacks": "1) Fundamental business information or practices. \"We need to scale back R & D and get back to brass tacks.\"2) The raw material required for a company's core products.Suggested by Pulkit B.", "Breadcrumbing": "Sweeping up multiple odd jobs into one single position. Fulfillment and respect not guaranteed.Suggested by Andy W.", "Break bread": "1) To share profits or wealth with another. \"If you're not willing to break bread on this, we walk.\"\r\n2) To hold a meeting with an informal and friendly tone (and maybe food). \"Let's break bread this afternoon and lock it down.\"Suggested by Chris B.", "Break your crayons": "To harm or insult another person. \"I don't mean to break your crayons, but your performance has been terrible lately.\"", "Brick and mortar": "A business with a physical location and building, as opposed to the basements and garages that most online retailers ship from.", "Bricks-to-clicks": "When a traditional company realizes that a website is necessary to stay competitive.", "Bring to the table": "The contribution (or lack thereof) that one makes to a group. \"What do you feel you would bring to the table if you were hired for this position?\"", "Bronx cheer": "A loud sound expressing dislike, made by sticking out your tongue and blowing; a raspberry.", "Brown-bag": "To discuss a topic at a later time, over lunch. \"Let's brown-bag your idea and get this meeting back on track.Suggested by Ben.", "Bubble it up": "To send an issue to the next-higher level of management. \"I've noted your concern and I'll bubble it up by the end of the week.\"Suggested by Charley O.", "Bucket shop": "A place where questionable deals occur.", "Bucketize": "To organize information into logical groups. \"Let's take a moment to bucketize our ideas.\"Suggested by Mo.", "Build": "Borrowed from software types, this term has been heard referencing a revision or addition to a piece of text. \"Still working on that report? Make sure I have the latest build by this afternoon.\"Suggested by Q.", "Bullish": "To be in favor of. \"I'm feeling bullish about this new product.\"", "Burn grass": "To sit down as a group and discuss. May reference assumed Native American culture. \"Make sure you burn grass with the engineering before tomorrow.\"Suggested by Eric.", "Burn rate": "The speed at which cash is being used up in a given company or project. \"We gotta get our burn rate under control, time to let a few go.\"", "Burn the boats": "Total commitment to an action that can't be undone. \"This 11th-hour financing gives us one final burn-the-boats shot at it.\"Suggested by Dean H.", "Bush league": "A baseball reference describing anything amateurish or unprofessional. \"That bush league secretary hung up on our biggest client while putting him on hold.\"", "Business-end": "The part of an object that performs an action. \"I looked up from my desk and found myself staring down the business-end of a 9 millimeter.\"", "Business-macho": "Describes a male office worker with his shirt opened too far at the neck—at least one button beyond what could be considered business casual. Often accented with tufts of chest hair or gold chains.Suggested by David R.", "Business-provocative": "Work attire that is sexy to the point of being inappropriate. \"I see that Kim has decided that the dress code for today is business-provocative.\"", "Buy-in": "To agree with a particular position. \"How can we get management buy-in on this idea?\"", "Buzz": "Excited discussion in the media and between individuals. Closely linked to word-of-mouth advertising.", "Buzzworthy": "A novel idea or product that has the potential to generate public interest in its own right. \"These proposals are all terrible. Why can't you morons come up with something buzzworthy?\"", "C-level": "Describes the people at the top of a company that get fancy 'C' titles such as C.E.O., C.F.O., and C.O.O.", "Cabinet condom": "Tape applied to the button of a filing cabinet to prevent it from being locked (since the key has long since disappeared.)", "Cadence": "A far too poetic way to describe how often a scheduled event is repeated. \"If we just hit the right cadence on our sprint meetings…\"Suggested by brat.", "Cafeteria plan": "A package of benefits that allows the employee to make choices.", "Calendar tickler": "A calendar entry with a reminder alarm. Usually sent as an Outlook meeting request. \"Throw a tickler on my calendar so I don't forget to join the call.\"Suggested by Erika S.", "Call on the carpet": "To discipline. \"If you keep exaggerating your expenses, it's only a matter of time before you get the carpet call.\"", "Can I stir fry an idea in your think-wok?": "Could I have your opinion on this issue?", "Cannibalize": "To launch a new product that takes market share away from one's own established products.", "Capsizing": "Laying-off employees (downsizing) to the point where an organization can no longer function.", "Captive lunch": "When management wheels in the sandwiches at 12pm, just when you thought you could escape to run a few errands.Suggested by Tom T.", "Care": "Synonym for 'concern'. Used by managers who don't want to admit to having concerns. \"I have a care about this budget decrease.\"Suggested by NoTable.", "Career Limiting Move (CLM)": "An action or comment that could hinder the future progression of one's career.", "Career suicide": "An action that causes you to lose both your current job, and any chance you'll find another one in your field. \"If you blow the whistle on this, it's career suicide.\"", "Carpool tunnel syndrome": "The semi-conscious state that is the result of repeated early morning ride sharing.", "Carrots and sticks": "Incentives and punishments. \"If you want to motivate these clowns, try less carrot and more stick.\"", "Carte blanche": "The freedom to make any and all decisions.", "Cascade": "Disseminate, for people who aren't comfortable saying the word disseminate. \"Document the learning and cascade it down the ranks.\"Suggested by Robin G.", "CFO": "Chief Finagle Officer. The person who's responsible for manipulating a company's finances to avoid legal penalties.", "Chainsaw consultant": "Someone brought in to do management's dirty work at lay-off time.", "Change agent": "Someone who claims to be a catalyst for improvement and the adoption of new technologies.", "Change management": "The act of guiding a company through internal or external changes.Suggested by Clive N", "Charm school": "A derogatory term for new manager training. \"After the harassment case, my boss was shipped off to charm school.\"", "Chartists": "Market analysts who feel that they can beat the market by reading graphs.", "Chasing butterflies": "A state of distraction experienced by those who are easily distracted. \"Jim never finishes anything; he's off CB again.\"Suggested by Brian.", "Chasing down smokestacks": "Placing sales calls to industrial companies.", "Checked Eskimo": "When a clearly unqualified individual lands a job or promotion they should have had no chance at getting, that person must have \"checked eskimo\" on the application.Suggested by David.", "Cheese chew": "Performing an unwelcome chore to please another.Suggested by Rob T.", "Chicken shop": "A department or company that produces substandard work. \"Their parts had a 20% scrap rate last quarter. I'm never dealing with that chicken shop again.\"Suggested by Rod SW.", "Chime in": "A timid little way of indicating that you have a point to make. \"Can I just chime in on that one?\" Alternative: Just start talking.Suggested by Jerry P.", "Chinese fire drill": "A project or meeting that is characterized by frantic confusion.Suggested by Jacada.", "Chinese wall": "Procedures to guard information.", "Circle-back": "To revisit an issue. \"I'm heading to lunch now, but let's circle-back Friday am.\"Suggested by Randi", "Circular file": "The garbage can.  \"Toss that newsletter in the circular file for me.\"", "Circular firing squad": "A dysfunctional group that's on the verge of collapse because of infighting and bickering.", "Cleans up well": "Describes a technician or software developer who can actually speak with the customer without embarrassing the company.", "Clock tower attrition": "Rapid-fire job cuts at the hands of an overzealous manager.Suggested by kramtronix.", "Clocksucker": "A completely unproductive employee; a waste of company money.Suggested by Lee.", "Close of play": "The end of the workday. \"You have until close of play Thursday to make it right, or I'll have to write you up.\"Suggested by Bill F.", "Coal face": "The department that actually works to deliver products and interact with clients. \"Give me an opinion from someone at the coal face.\"Suggested by Joel", "COB": "Close Of Business. That magic moment that comes but once each day -- quitting time.Suggested by our spies at a Fortune 100.", "Cold towel": "To put on hold. \"Let's cold towel your feedback until you get back next week.\"Suggested by Gordon.", "Color outside the lines": "To ignore established rules/limits of behavior. Pseudo-profound boss says, \"The lines haven't changed, your coloring has.\"Suggested by Catherine", "Column-shaking": "Threatening to uproot the traditions (or bad habits) of a company, usually with new and unconventional ideas.", "Come to Jesus meeting": "A term of southern American origin that refers to a serious meeting with an individual or team. These meetings often involve ultimatums for performance improvement.Suggested by aclassicgirl.", "Commonplate": "To present a topic for consideration, so that all members of a group have the same information. \"Now that I've commonplated the issue, can we come to a reasonable decision?\"", "Comp": "The cool way to say complimentary.", "Compliment sandwich": "A pointed criticism delivered between two compliments to dull the blow. Build them up, tear them down, then leave on a positive note.Suggested by Jeff B.", "Cone of Silence": "Indicates a private, confidential conversation. \"I have something important to share with you. Can we put on the Cone of Silence?\"Suggested by Jonathon T.", "Connectivity": "The extent of one's professional network. \"The right equity partner will deliver on their connectivity from day zero.\"", "Contemplation": "Thought or group consensus. \"Just spoke with management and the contemplation is that we're behind schedule.\"", "Contraction": "Widespread layoffs. \"In order to prepare the organization for sale, all employees should brace for further contraction.\"Suggested by Elizabeth M.", "Contrarian": "An investor who makes decisions in opposition to mainstream ideas.", "Cook the books": "A fraudulent attempt to falsify company records.", "Cookie cutter": "A generic person, product or approach. \"I'm so tired of these cookie cutter b-school grads.\"", "Cooperative competition": "A classic management oxymoron presumably referring to mutual benefits experienced by two competing firms.", "Coopetition": "The ruthless struggle between an organization's departments for limited budget dollars, staff and equipment, despite the fact that everyone involved should be supporting the overall mission.Suggested by Aidan.", "Core competencies": "A company's most successful skills and activities. Often leveraged.", "Corporate memory": "The entire set of company files and records. \"Never in corporate memory has the board been so disrespected.\"Suggested by Eimear B.", "Cost containment": "An attempt to reduce expenditures.", "Counterposing": "When ground-level staff outwit management by using more jargon, more pointless questions, and more vague commitments than their superiors.Suggested by Captn Freedom.", "Covered-off": "Describes something that has been completed or otherwise taken care of. \"Let's make sure those requirements are covered-off.\"Suggested by Garry.", "Cowboy": "A worker that is difficult to supervise.", "CPB": "Conducting Personal Business. Using company resources and time for things that aren't work-related (there's a good chance you're doing it right now).", "CPS": "Cheap Plastic Shit. Promotional items (often made of plastic) distributed through advertising, corporate gifts, trade shows, or other give-away programs.Suggested by Jocelyn S.", "Craft": "An insufferable way to refer to your line of work. \"Honing your craft...? First of all, data entry is not a craft. And you're really not much of a honer.\"", "Createalytics": "The art of manipulating data to support a preconceived decision.", "Creative": "An art or design asset. \"Call the vendor and push a rework on the creative.\"Suggested by Jamie", "Critical mass": "Enough. \"My instructions were clear: Don't stop hiring until staffing reaches critical mass.\"Suggested by Hugh Y.", "Criticality": "An extreme level of importance. \"I cannot emphasize the criticality of this issue enough.\"Suggested by Shane H.", "Cronyism": "Playing favorites among close associates.", "Cross sabers": "To have a conflict.", "Cross-pollination": "The generation of ideas that can occur when individuals from diverse backgrounds are brought together. \"By removing your cubicle walls, we hope to cultivate the opportunity for cross-pollination.\"", "Cross-training": "Learning a colleague's job so you can perform it, in addition to your own, when they disappear during vacation, maternity leave, or the latest round of layoffs.Suggested by Isabella.", "Cubicle vultures": "Those who gather office supplies from the desk of a fired co-worker.", "Curate": "Adds a whiff of sophistication to any mundane selection process. \"As Chief Social Media Jedi, you'll be deeply involved in curating our Pinterest identity.Suggested by mcdermott", "Customer intimacy": "A measure of how well a company knows its client base. Protip: Never say \"customer intimacy\" in front of the customer.", "Cut the mustard": "To perform adequately.", "CYA": "Cover Your Ass. To exercise caution to avoid blame. \"You better CYA on this one. We can't afford the bad press.\"", "Cyberslacking": "Wasting company time by casually browsing the Internet or instant messaging.Suggested by Mike.", "Cycle": "An employee's time, broken down into sections. \"I'll have to check if she has any free cycles for this task.\"Suggested by Renee.", "D-PAD": "Downloading Porn All Day. When an employee has nothing to do. \"Now that the project is finished, I'm looking forward to a little D-PAD.\"Suggested by minorfall.", "Daily driver": "Functional, reliable equipment for day-to-day productivity. \"The touchscreen is cute, but it's not going replace my daily driver.\"", "Data-point": "An area of factual inquiry.Suggested by Joe O.", "De-integrate": "To disassemble. \"We're going to have to de-integrate the entire assembly and start from scratch.\"", "De-layering": "An excuse to fire multiple levels of a hierarchy without reducing the total workload. (see also, Empowerment)Suggested by Jane W.", "De-tune": "To minimize in style or message. Synonym: tone-down. \"You really need to de-tune those hideous slides.\"Suggested by Natalie R.", "Dead stick": "Describes a project that has lost momentum. This is an aviation term used when a plane is on the verge of losing control.Suggested by Derrick.", "Dead Tree Edition": "Printed version of a document or presentation. \"We already have it in PDF, why do we need the dead tree edition?\"Suggested by Primus", "Dead wood": "An employee that no longer contributes anything meaningful to an organization.", "Deceptionist": "A receptionist whose job is actually to delay or block potential visitors. Ruthless with a polite, perfect smile.", "Decision sniper": "The person that sits quietly in a meeting until just before a decision is reached, then raises a question that forces the group to reconvene later.Suggested by Brian W.", "Deck": "A PowerPoint slide presentation. \"Clean up those slides before you even think about running that deck again.\"Suggested by Gomo.", "Decruit": "A clever euphemism for firing senior employees. \"The board is pushing for decruitment.\"Suggested by Amanda G.", "Deep dive": "An in-depth study.", "Deep pockets": "Rich investors. \"We need a few more deep pockets on board before we move forward.\"", "Deep six": "A borrowed military term meaning 'to dispose of.'", "Deferred success": "A term used to postpone the declaration of failure, as if a positive result is guaranteed (just not right now). \"The project was a deferred success; we're confident that things will pick up in the next quarter.\"Suggested by Aidan.", "Dehire": "To fire.", "Deja moo": "The nagging feeling that you've heard this BS before.", "Delagatorship": "A business entity run by someone incapable of decision-making.Suggested by Matt F.", "Deliver the goods": "To come through on an agreement.", "Delta": "Pretty much the coolest way to speak about a change or difference. \"We're talking about a 2% delta on the cap rate.\"Suggested by Cash M.", "Deploy": "Execute; release to the public. Makes the speaker feel like he's planning D-Day instead of some insipid PR launch.Suggested by Irene G.", "Descope": "The art of removing requirements or features from a project to make it appear completed. \"The web deliverable was descoped yesterday and victory was declared.\"Suggested by JCSmith.", "Deselect": "To fire or lay-off. \"We need to deselect five people from your department to meet cost targets this year.\"Suggested by Don.", "Desk dive": "The painful crawl underneath your desk to unplug equipment or fetch a dropped item.Suggested by Jessica.", "Desk jockey": "An office worker.", "Deskfast": "Breakfast eaten at your desk.", "Diagonal slice meeting": "A large meeting involving staff from several teams. Try not to think about costs as 26 people discuss their feelings.\nSuggested by Henry H.", "Dial and smile": "Phone calls intended to recruit new customers.", "Dial-in": "A simply terrible way to say 'include'. \"Let me dial-in marketing on this one.\"", "Dialogue": "To have a conversation. \"Let's dialogue later about the Miller account.\"", "Dialogue marketing": "A marketing strategy that tries to create a two-way rapport with the customer.", "Diarize": "To ensure that all relevant details are recorded. \"Don't pack up until these learnings are diarized.\"Suggested by Lesley.", "Diary forward": "To record new knowledge and apply it in the future. \"Managers will conduct a 15 minute walkdown each day and diary forward to cover all shifts.\"Suggested by Rob A.", "Die on the hill": "To over-commit. \"The client's pushing for a Friday go-live? No thanks. I'm not dying on that hill.\"Suggested by Renee", "Different breed": "A derogatory reference to a strange person or thing. \"Night shift servermonkeys really are a different breed.\"", "Digerati": "An elite group of people that know more about computers than you ever will.", "Dime store": "A business that sells extremely cheap items.", "DINK": "Double Income, No Kids.", "Dinosaur": "A long-term company employee whose extensive experience is only surpassed by his resistance to change.Suggested by Aaron D.", "Dip your pen in company ink": "Having sexual relations with a coworker.Suggested by Brad", "Directionally accurate": "A terrible euphemism for describing a failed guess. \"You have to admit that our conclusion was at least directionally accurate.\"Suggested by ACP.", "Dirty laundry": "Questionable business practices or documents that an organization would prefer to remain secret.", "Dirty pool": "Unethical practices. \"Her lawyers are really playing dirty pool on this one.\"", "Disambiguate": "An ironic 5-syllable word used in place of 'clarify.'", "Disconnect": "An inconsistency or problem. Another terrible noun created from a perfectly good verb.", "Disimpress": "To reverse a favorable impression with subsequent behavior. \"We liked him at the first interview, but he really disimpressed us in the second round.\"Suggested by Jason I.", "Disincentivize": "To reduce the motivation to make a particular choice. Please, just never say this word.", "Disintermediate": "The process of removing the middle man. Lord help us.", "DK": "Short for Don't Know. To renege on a deal by claiming that terms are missing or incorrect. \"Joan DK'ed me when her options took a bath.\"Suggested by Papa", "Do the needful": "A reminder to actually do the work you're being paid for. \"…and if that means coming in Sunday, we're going to do the needful.\"Suggested by Michael W.", "Doability": "Used to describe whether an activity can be undertaken. \"I need to confirm the doability of that request.\"Suggested by Beneboy", "Dog": "A badly performing product or company.", "Dog and pony show": "An overlay staged presentation that has more style than substance.", "Dog in this fight": "Presence in a given market. \"Find out what the competition is up to, and make damn sure we get a dog in this fight.\"Suggested by Jack.", "Dogfooding": "The practice of forcing developers to use their own product (or 'eat their own dog food') to better understand the customer experience.Suggested by Programmer Type.", "Doingness": "An invented, pseudo-eastern concept of active participation. The kind of word that whole consulting empires are built around.", "DOMA": "Die Or Move Away. One way to lose customers.", "DOMO": "DOwnwardly MObile. A young person who changes their priorities and quits a high paying, demanding position.", "Don't f*** with payroll": "Blunt advice about avoiding romantic or sexual relationships with co-workers.Suggested by Max", "Don't fight the tape": "Don't oppose the market trend.", "Don't get your meat where you make your bread": "A food metaphor about the perils of hooking up with coworkers.Suggested by Jason F.", "Donkey work": "Mundane tasks requiring minimal skill to complete. \"I'm so done with this donkey work. Internships are the worst.\"", "Dopeler effect": "The principle that stupid ideas sound better when they come at you quickly.", "Double dip": "To retire, but then start another career.", "Double-time": "A military term meaning to act quickly. \"Get that invoice out double-time!\"", "Dovetail": "To expand upon a fellow employee's idea. Claiming it as your own is optional. \"That dovetails nicely into my point.\"Suggested by Johnny P.", "Down and dirty": "To perform a task quickly without considering quality.", "Down the rabbit hole": "A promise that what follows will be compelling, highly-detailed, and maybe a little crazy. \"Let's double-click this icon and head straight down the rabbit hole.\"Suggested by Jon E.", "Downsize": "To reduce the size of a workforce. Often begins with requests for voluntary resignations and ends with a series of layoffs.", "Drill down": "To investigate thoroughly. \"Let's meet this afternoon and drill down on this one.\"", "Drink from the firehose": "To be overwhelmed with information.Suggested by Crazy Renee.", "Drink the Kool-aid": "To accept company policy without question.", "Drive beyond the headlights": "To get ahead of oneself. \"Stop me if I'm driving beyond the headlights here, but I want to share an amazing home-based business with you.\"Suggested by Crazy Renee.", "Drop-dead date": "The REAL deadline. Missing it often means dire consequences.", "Dropping packets": "A state of forgetfulness caused by burnout or lack of sleep. \"You hungover again? You've been dropping packets all morning...\"Suggested by David M.", "Dub-dub-dub": "A quicker (and nerdier) way to refer to the beginning of a website address. \"You have to check out dub-dub-dub dot...\"Suggested by Chandra C.", "Duck shove": "The act of passing a difficult question or task to an unsuspecting third party. \"I duck shoved that paperwork over to Jonathon.\"", "Duck shuffler": "Someone who disrupts your affairs after you've finally gotten all your 'ducks in a row.'", "Ducks in a row": "To become organized.", "Due diligence": "The thoroughness required to make good business decisions.Suggested by Pulkit B.", "Ear candy": "Flattery.", "Eat a reality sandwich": "Necessary when someone's ideas are completely inappropriate for the given situation. \"I can't believe you said that to the committee. You better eat a reality sandwich before you walk back in that boardroom.\"", "Eat drink sleep": "Complete and total dedication to a role. \"…but my real passion is market segmentation. I eat drink and sleep analytics.\"", "Eat the elephant one bite at a time": "A reminder that even the largest problems can be solved by breaking them down into manageable bits. \"Elephant in the room? One bite at a time, love.\"Suggested by Kelly G.", "Eat the frog": "To complete an unpleasant job that has been well procrastinated. \"Just eat the frog and get on with it!\"Suggested by Emma-Dawn L.", "Econometrics": "Marketed by consultants as a super scientific financial modeling exercise. Reality: Plugging three numbers into a pre-made spreadsheet.", "Economical with the truth": "An aggravating euphemism for lying. \"My esteemed colleague may not in fact realize he is being economical with the truth!!\"", "Ego surfing": "Searching the web for references to oneself.", "Eighty-six": "To dispose of. \"We have to eighty-six these documents or we'll all be crucified.\"", "Elephants": "Large investment groups that tend to move together.", "Eleventh hour": "The last moment.", "Empty suits": "Unthinking middle management.", "Enail": "An email sent for the sole purpose of making a point in writing, usually at another person's expense. Most effective when cc'ed to as many senior people as possible.Suggested by Ian C.", "Enculturate": "To make something part of daily office life.Suggested by Mike B.", "Enthuse": "To inspire enthusiasm (or attempt to). \"I'm still looking for a way to enthuse the new hires.\"Suggested by Andy P.", "Entremanure": "A self-employed risk taker that can't catch a break. Everything he touches turns to shit.Suggested by Erin S.", "EPON": "Endless Pit Of Need. A colleague who continually seeks support for their ongoing personal and professional problems.Suggested by M. Schroeder.", "Evangelize": "To promote a product with the enthusiasm of a true believer. \"We need distributors to evangelize the new line to local markets.\"Suggested by Nicky T.", "Even dead cats bounce": "Even worthless things can rise in value again.", "Exploding offer": "A job offer that expires after a certain date.", "Extract the max": "To achieve the highest level of productivity possible while directing a group of people. \"I hope my management style will extract the max from each and every one of you.\"", "Extrapediately": "Faster than ASAP and quicker than STAT, this made-up word is saved for when a task must be completed almost instantly.Suggested by CM & JC.", "Extraview": "A second interview you feel obliged to hold even though the position has already been filled. Can also be scheduled when the candidate is just so damn hot.", "f/u": "Shorthand for follow-up. Use with caution. \"Make sure your whole team's prepared for the f/u.\"Suggested by Cindy T.", "F2F": "A really cute way of saying face-to-face.", "Face time": "1) The opportunity to sit down to discuss an issue in person. \"I've been trying to get a little face time with the boss to go over this proposal, but she keeps blowing me off.\"2) Unproductive time spent at the office meant to project the image that you're a hardworking employee.Suggested by Randi H.", "Facipulate": "An unfortunate mix of 'facilitate' and 'manipulate', it refers to influencing the course of a discussion by indirectly promoting certain lines of thought.Suggested by Ed T.", "Fact pattern": "A set of supporting evidence. \"Mary keeps calling in sick on sales presentation days. Interesting fact pattern, don't you think?\"Suggested by Bob S.", "Fairy dust": "The finishing touches on a project. \"Sprinkle the fairy dust on that one for me, will ya?\"Suggested by Steve B.", "Faker's dozen": "When someone calls out sick twelve times during a year, they've pulled off the \"faker's dozen\".Suggested by Jordan M.", "Fall guy": "A scapegoat. After the buck is passed through the entire organization, it stops at this unfortunate person.", "Fallen angels": "Investments that once performed well but have declined in value.", "Faulty-tasking": "Taking on extra responsibilities to the point of being error-prone at one or all of them.Suggested by Mad Casual.", "Featherbedding": "Keeping jobs that aren't needed in order to please the union.", "Feature creep": "The tendency to continually add more features during the development of a product.", "Feed the gorilla": "To ensure that the core part of a company is solid before trying more interesting or high-risk projects.Suggested by Andy W.", "Feeding frenzy": "Intense buying by consumers. \"They opened the doors at 12:01 am and kicked-off the feeding frenzy.\"", "Fenestration": "Windows. Please, please just say windows. \"This 10th floor rental unit has excellent fenestration.\"", "File thirteen": "The garbage can.", "Financial slack": "The cash buffer that sustains operations until more funding can be secured. \"We're looking at 3 months slack till it all goes pear-shaped.\"Suggested by Nate B.", "Finger in the wind": "To reach a decision arbitrarily, with no clear rationale. \"Don't put your finger in the wind and call it due diligence.\"Suggested by Sinking ship", "Finger-of-blame": "An arbitrary method for selecting the person who will take responsibility for a mistake. The blame is usually way out of proportion with the actual error. \"Uh-oh... the finger-of-blame finds ... YOU!\"Suggested by DJ.", "Fire away": "Proceed whenever you're ready.", "Fire fighting": "Addressing a problem that must be solved immediately. \"We've been fire fighting since last quarter's numbers were released.\"", "Firestarter": "Someone known for inventing/exaggerating problems, then calling countless meetings to find a solution and be the hero.Suggested by fefe", "Fish or cut bait": "To be forced to make a decision. \"We're getting to the point where we have to either fish or cut bait on this one.\"", "Fishbowl": "To be in the public spotlight.", "Fishing expedition": "1) A fact-finding mission.2) A concerted effort to find something—anything—wrong.Suggested by Vic P.", "Fix it in pre": "A recommendation to address problems early before they grow to large, costly mistakes.", "Flavor of the month": "The most recent fad to hit Corporate America. Social-buying bubble, amirite?Suggested by Dave.", "Flight risk": "An employee that is thought to be considering quitting.", "Flub": "To miss.", "Fluff it and fly it": "To make cosmetic improvements and then sell an item.", "Flunky": "A worker at the bottom of the corporate food chain.", "Flush": "Possessing a large amount of money.", "Fly-tipper": "A manager who avoids confrontation by quietly dumping work on the desks of his subordinates when they're not around.Suggested by Jon H.", "Flying a kite": "Initiating a project with no defined end point. Or starting point.Suggested by B. Potter.", "Flying circus": "When company management takes a flight to inspect a local branch. \"The flying circus will touch down tomorrow afternoon. Make sure we're ready for them.\"", "Followship": "The prized ability to obey direction without question. \"Great followship leads to great leadership.\"", "Food chain": "An organization's hierarchy. \"I'm going to send this up the food chain for approval.\"Suggested by  D Ochoa.", "Foot on the ball time": "Borrowed from football, this is a chance to pause and gain control of a situation. \"If you don't give me a little more foot on the ball time, I'm going to blow this presentation.\"Suggested by Sean.", "Foreseeable future": "A conveniently flexible period of upcoming time. ", "Former life": "A clever way for speakers to refer to prior career positions. Often used by the speaker to highlight how far they've come in life. \"In a former life, I sold insurance door-to-door.\"Suggested by Sam M.", "Free cell": "An empty cubicle that was formerly inhabited by someone who played too many games of Free Cell.Suggested by JC.", "Free lunch": "Something for nothing. Rare in the state of nature.", "Free seminar": "A sales presentation disguised as useful information.", "From a _____ perspective": "Three words of unnecessary padding around the subject at hand. \"We're low on toner, from an office supplies perspective.\"", "Front burner": "The opposite of back burner, obviously. Reserved for the most pressing matters. \"Frontburner your account outreach until we rollout.\"", "FUBAR": "F***ed Up Beyond All Repair.", "FUD factor": "The amount of Fear, Uncertainty, and Doubt created in a customer during the sales process (which is then conveniently addressed by your product or service).Suggested by David R.", "Full optics": "A complete view. \"We don't have full optics on the situation presently.\"Suggested by BT.", "Full-court press": "A term borrowed from basketball that's used to describe a maximum effort. \"If we're going to regain our market share, we need a full-court press from your sales staff.\"", "Function": "To complete a task or action item. \"Bob, make sure you function the inbox and delegate accordingly.\"Suggested by kramtronix.", "Future-proof": "A product that is claimed to be immune to obsolescence.", "Gain traction": "To increase market share.", "Game plan": "A borrowed sports term referring to a predetermined strategy.", "Game-changing": "Describes a fundamental shift. \"Our transition from products to solutions is nothing short of game-changing.\"Suggested by Nick.", "Gatekeeper": "A person that controls the flow of visitors and information to/from management. You should get lunch with this person.", "Gazump": "To increase the price of an item after an agreement has been made.", "Generica": "The parts of the US that are so overrun with national franchises, that it's impossible to tell one city from another.", "Geography": "Sales region. \"No way I can make that 4 o'clock. It's clear across my geography.\"", "Gerbil tubes": "The covered walkways that connect buildings on a large campus.Suggested by Tanya", "Get into bed": "To begin a close business relationship. \"I want to airtight due diligence before getting into bed on this.\"Suggested by Paul N.", "Get the axe": "To be fired.", "Get-go": "The beginning. \"We need strategy alignment from the get-go.\"Suggested by Russel H.", "Ghost work": "The uncompleted tasks that laid off employees leave for the rest.", "Gisted": "To provide a summary. \"Don't forget that I want those reports gisted before they reach my desk.\"Suggested by Nick.", "Give the dog a bone": "To add an obvious error to a report for the boss to find and correct. Helps avoid changes to the important bits.Suggested by Sam.", "Give the nod": "To approve of a course of action.", "Glad-handing": "To shake hands with all present. \"If you're finished glad-handing the room, we can all get started.\"", "Glide path": "The planned series of steps that lead to a defined goal. \r\n\"I'm not going play-by-play on the glide path, just hit your damn numbers.\"Suggested by Tom T.", "Go suit": "To be promoted to a management position and forget your technical roots (and possibly skills).", "Go-live": "The public debut of a project. \"Fifteen days till go-live, people. Get it done.\"Suggested by Brett.", "Goat rodeo": "An especially chaotic meeting or event. \"The last earnings call was a complete and total goat rodeo.\"Suggested by ML.", "Gofer": "A subordinate worker who is often given menial tasks.", "Going forward": "Two words of unnecessary filler that are often used to shift focus from negative past results to bright future possibilities. \"Market headwinds dipped our bottomline, but we're expecting higher earnings on a go-forward basis.\"Suggested by Tom N.", "Goldbricker": "An employee who works harder at looking valuable than actually contributing.", "Golden goose": "A company's most highly valued asset.", "Golden handcuffs": "Monetary incentives used to retain executives.", "Golden parachute": "A generous compensation package. Often given to executives after they are laid-off.", "Goodness": "Elements of quality. \"There is much goodness in your proposal.\" Uggh.Suggested by John R.", "Gracious Space": "A safe, supportive setting where all can feel comfortable, warm... creative. And nobody ever challenges your PC worldview.Suggested by Anne K.", "Granular": "In excessive detail. \"Summarize this for me, you're being to granular.\"", "Grassroots": "Built from the bottom up, without any formal training or organization. Suck on that, elitists!", "Grasstops": "People in positions of leadership or influence at the local level (an unfortunate play on the word \"grassroots\"). \"Our grasstops efforts have really put us on the map in central Delaware.\"", "Gravy": "1) Any additional benefits beyond what's expected.2) A boon or windfall.\"If we peak above the earnings forecast, it's pure gravy.\"Suggested by Jonny A.", "Grease": "To bribe.", "Grease the skids": "To give advance notice to a select group before public action is taken. \"Let's connect over breakfast and I'll grease the skids before the board votes.\"", "Greater fool theory": "The idea that there is always someone willing to pay a higher (and unreasonable) price.", "Green field": "Virgin territory, an untapped market.Suggested by Scott.", "Green-field thinking": "Considering new markets and innovations. \"Why don't you drop the green-field thinking and just define what we're already doing.\"Suggested by Amy L.", "Greenwashing": "Claimed environmental practices that are nothing more than PR fluff.", "Grey-sourcing": "Hiring ancient programmers to support equally ancient IT systems.Suggested by Steve H.", "Grip and grin": "Obligatory hand shaking and fake smiles before a meeting. \"Now that we've taken care of the grip and grins, shall we begin?\"Suggested by Primus", "Hack it": "To be successful. \"Do you think she can hack it?\"", "Hammer out": "To reach a consensus after a long debate.", "Hammock task": "An assignment with very little work or responsibility. \"If you gave me more than hammock tasks, maybe I could earn that raise.\"Suggested by Sam M.", "Hand-grenade close": "Roughly on-target, but with room for error. \"Just get those numbers hand-grenade close and the client won't know the difference.\"", "Hand-holding": "Helping an inexperienced or incompetent person perform a task that's beyond their abilities. \"I'm so sick of hand-holding the new guy through all of our billing procedures.\"Suggested by David.", "Hang the bell on the cat": "Deliberate risk-taking and leadership. \"Trade secrets be damned. Bell the cat and get our name out there.\"Suggested by Lou.", "Hard hat": "A derogatory term for a manual laborer. \"This new robot line means redundancy for a few dozen hard hats.\"", "Hard stop": "The non-negotiable end of a meeting. Usually announced at the start. \"Clients are visiting this afternoon so we have a hard stop at two.\"", "Hardball": "Aggressive business tactics.", "Hatchet man": "A low-ranking manager given the task of firing people.", "Haul": "A large amount of money.", "Head shed": "The offices of top company leadership. \"…well if you're so convinced, why don't you ride on up to the head shed and demand an audience?\"Suggested by Vinnie B.", "Head shunting": "The secret hiring of a head hunter to persuade an ineffectual employee to take a position at another firm. Nicely eliminates the mess of having to fire someone.", "Head winds": "Factors that slow progress. Also a convenient way to externalize the blame for project delays.Suggested by Tony.", "Head-count freeze": "A lack of available jobs at a given company.", "Head-down": "Describes the process of working completely uninterrupted. \"I have a client meeting in two hours so I'm going to be head-down and not taking any calls.\"Suggested by Matt.", "headdesk": "One's inevitable reaction to poor treatment or abject stupidity in the workplace. \"YOU: Looks like those raises are going to be delayed another three months. ME: headdesk.\"Suggested by Merlion.", "Headlight": "To bring up a topic for discussion before it becomes a larger issue.", "Headline": "A single sentence summary. \"Look Charles, I'm going to give you the headline: We're downsizing and tomorrow is your last day.\"Suggested by Elle B. and uplah", "Heads up": "A notification or early warning. \"I just wanted to give you the heads up about the latest contracts.\"", "Heavy lifting": "The hard work.", "Heisman, the": "Kept at arm's length; denied. \"I almost closed my last few sales calls, but they keep throwing up The Heisman.\"Suggested by Pete.", "Helicopter view": "An overview or summary of an issue. \"I've got 30 seconds so give me the helicopter view.\"", "Herding cats": "Managing a chaotic and difficult situation. \"Motivating you people is like herding cats!\"", "Heritage": "The markets and business practices that have been a part of an organization since its inception. \"If we don't evolve from our heritage, we'll be insolvent within a year.\"", "Heyday": "The best of times.", "High-wire act": "A risky business situation.", "HiPo": "High Potential. The top talent of an organization. \"Identify and reward your HiPos or the competition will.\"Suggested by Michelle.", "HiPPO": "Highest Paid Person's Opinion. The deciding factor in workplace arguments. \"What can we do to get HIPPO buy-in on this layout.", "Hired guns": "Specialized professionals hired by an organization.", "Hit the fan": "When a situation gets out of control.", "Homing from work": "Using technology to keep in touch with personal concerns while at work.", "Horizontal": "A product or service that benefits a wide range of companies/industries. \"We have dozens of horizontals across multifarious rev streams.\"Suggested by Geoff M.", "Horsehead offer": "A proposition so compelling, it can't be refused. \"He called to cancel, so I dropped the horsehead offer: 60% markdown.\"", "Hosed": "1) Non-functional, usually in reference to technology.2) In deep trouble. \"If we can't get these reports printed before this afternoon's meeting, we're hosed.\"Suggested by Ben S.", "Hot buttons": "A management idea that each employee should be responsible for decision-making.", "Hot under the collar": "Angry.", "Hot-desking": "The practice of having a group of employees share a section on unassigned desks.", "Hum a few bars": "A request to provide a verbal summary. \"Your report was far too long. Can you hum a few bars?\"Suggested by Lea G.", "Human capital": "A new way of referring to employees as living assets.", "Hump day": "The middle of the week (Wednesday). Settle down.", "Hunker-down": "To prepare for difficult business challenges ahead. \"We need to hunker-down for the next round of plant shut-downs at GM.\"", "Hush money": "A bribe to ensure that certain information isn't revealed publicly.", "Hypertasking": "The practice of combining several unrelated activities into one. This often blurs the lines between personal and professional time.", "I hate to say \"I told you so\"": "I told you so.", "Idea shower": "A creative group exercise where suggestions are made in rapid succession. Creeper boss says, \"Shower me… with ideas.\"Suggested by Operatic Bacon", "Ideation": "An overused portmanteau of \"idea\" and \"creation\". Psychologists have a legitimate use for this word. You probably don't.Suggested by Janice H.", "Ignoranus": "Someone who is both stupid and an asshole.Suggested by John W.", "Imagineer": "A contraction of \"imagine\" and \"engineer\" used to describe the wasting of time and money to develop an unnecessary solution to some non-existent business problem.Suggested by The Village Idiot.", "Impactful": "Having a large effect. An ugly, ugly extension of the word 'impact.'", "In my world": "You plebs couldn’t possibly understand what it’s like for someone in my position.Suggested by Catie", "In the black": "Profitable.", "In the cards": "A likely outcome.", "Incent": "To encourage an action by suggesting a reward. A particularly terrible verb created from the noun incentive. \"I think we can incent investors to get on-board with this one.\"", "Income not IF-come": "A business needs cash, not the promise of cash.Suggested by Lyndsey.", "Industrial vacation": "A business trip to a desirable location that is loosely related to business. Usually requires participants to arrive a few days early to \"prepare\" and stay a few days after to \"wrap-up.\"", "Insourcing": "The practice of looking within one's company for someone with required skills.", "Interface": "To communicate. \"Can we interface just before lunch?\"Suggested by Linda", "Interlock": "Meeting in order to coordinate. \"Stop by my office and we'll interlock later.\"", "Into the weeds": "Presenting excessive detail when the expectation was to stay at a basic overview level. \"Can we find one damn engineer who can speak about their work without diving into the weeds?\"Suggested by Kenny.", "Involuntary entrepreneur": "A laid off employee with poor prospects who is forced to work multiple transient jobs.", "Involuntary reduction in force": "A round of firings made after requesting that people volunteer to quit.", "Irregardless": "A false merger of regardless and irrespective; incorrectly used in lieu of either.Suggested by Antti L.", "Issue": "In a positive and affirming workplace the word 'problem' is swapped for the much more diplomatic 'issue'. \"Houston, we have an issue.\"Suggested by Tracy.", "ITL": "In The Loop. Describes an awareness of key issues. \"Bring me up to speed. I'm not ITL on this one.\"", "Jargon basement": "The worst of the worst, nails-on-a-chalkboard jargon.", "Jargonaut": "A true master of ridiculous jargon, this individual has a robust vocabulary, but none of it means anything.Suggested by Chuck H.", "Jawbone": "To talk someone into doing something.", "JDI": "Just Do It. Something that your boss believes any reasonable person could complete quickly and simply. \"End of discussion. This is a JDI; get it done!\"Suggested by Matt.", "Jingle": "A phone call. \"Just give me a jingle before you head home today.\"", "Job lock": "Employees that want to leave their jobs, but don't want to lose their benefits.", "Job-ready": "A potential employee that has the right qualities.", "Jobfuscate": "To make your job appear so complex that others, especially your boss, can't possibly understand it.Suggested by Sue C.", "Jobstopper": "A tattoo on a part of the body that isn't covered by business-casual.", "Jockey for position": "To compete for a larger market share.", "John Hancock": "Signature. \"We just need your John Hancock on these forms.\"", "Johnny-come-lately": "A late entrant into a particular market.", "Juice": "Connections, influence.", "Juice moment": "Giving direction with a patronizing amount of detail, as if speaking to little children. Don't forget your juice, kids.Suggested by Chris K.", "Jump the couch": "When unpredictable or strange behavior has a negative impact on one's reputation.", "Kabuki Dance": "An elaborate display with no real substance; an artful deception. Currently making the transition from pompous political jargon to pompous corporate jargon. \"Can you believe the Kabuki Dance they're calling journalism these days?\"Suggested by Crazy Renee.", "Keep your powder dry": "To hold back capital or information for use at a later date. \"I want to keep our powder dry here; don't mention the foreign accounts unless they ask.\"Suggested by Crazy Renee.", "Keepage": "The opposite of garbage.", "Keyboard plaque": "The collection of greasy dirt that builds up on keyboards.", "Kicker": "Something added to a deal to make it more attractive.", "Kicking goals": "Borrowed from Aussie Rules football, this expression refers to the achievement of good results, especially in reference to sales. \"OK boys, it's time to get busy on the phones and start kicking goals.\"Suggested by Kevin T.", "Kid gloves": "Handled with care and delicacy. \"This is a sensitive topic so you better get out the kid gloves.\"Suggested by Sarah.", "Killer app": "Originally referred to a software company's flagship product that solves a large and profitable problem. Non-tech firms have adopted the term, and it's getting uncomfortable. \"Affordable container shipping is our killer app.\"", "Kilting": "To make preparations for the Scottish market.", "Knot up": "To don a tie for a particular meeting or presentation. \"Clients are here in 10… time to knot up, boys.\"Suggested by Mike R.", "Knowledge density": "A vague measure of expertise. \"Sorry, I don't have the knowledge density to address that\" = I have no clue.Suggested by Chris S.", "Knowledge growth": "The amount learned in a given period of time. \"This roleplaying exercise should capture your knowledge growth.\"Suggested by Rob A.", "Kowtow": "To defer to or pamper.", "KT": "Knowledge Transfer. The exchange of information between outgoing employees and their eager replacements. \"We had better schedule some KT before half our trade secrets walk out the door.Suggested by Roy S.", "Kudos": "Congratulations.", "Kumbaya": "Saccharine and non-confrontational. Peace, love, harmony, etc. \"I don't have time for this kumbaya bullshit.\"", "Language": "Text or content. \"You need to rework the language on the Broker portal.\"Suggested by Elise B.", "Languaged": "Composed a document. \"I'm happy to see that you finally languaged the new protocol.\"Suggested by Michael D.", "Last man standing": "The senior-most employee remaining after a round of executive lay-offs. The last man standing usually inherits a set of responsibilities that he is totally unqualified to perform.Suggested by Mad Casual.", "Lateraled": "To be transferred to another position at your current level. \"Instead of the promotion I wanted, I was lateraled to another division.\"", "Lawyer up": "Assembling a team of attorneys, usually after PR efforts have failed to sway public opinion.", "Lay of the land": "The current state of things. \"What's the lay of the land up your way?\"Suggested by Hieronymous B.", "Lay your silver on the table": "To fully describe the products or services offered during a sales meeting. \"Just look each one in the eye and lay your silver on the table.\"", "Lead balloon": "A complete failure.", "Lead lung": "Spokesperson. \"Please direct your questions to Mr. Harris. He's lead lung until further notice.\"", "Lean in": "The act of appearing engaged and motivated, when you actually just want to throw up.Suggested by KT.", "Learnings": "New knowledge gained from a given experience. \"As a post-mortem, what learnings we can take away from this exercise?\"Suggested by Eric.", "Leave-behind": "Information presented on a sheet of paper. \"Make sure you really sell it with the trade show leave-behind.\"Suggested by Elise B.", "Left lane": "To accelerate a project. \"I'll need to requisition more personnel to left lane your ideas.\"Suggested by Johny C.", "Left-handed compliment": "Congratulations that are actually subtle insults.", "Legal scrub": "Having a lawyer re-word a document to reduce the risk of future legal action.", "Lens": "A point of view; a corporate microscope. \"I want to make sure that we're looking at this through the right lens.\"Suggested by Ben.", "Let it drip": "Allowing time for a new idea to become known and understood. \"Let it drip a little longer next time and you won't shock the board.\"Suggested by Brian", "Level-set": "To ensure that everyone is at the same 'level' of understanding. \"You better level-set your team before you send them on-site.\"", "Leverage": "To make use a resource.", "Lick and a promise": "Insufficient preparation. \"Tom sent me into the shareholder's meeting with nothing but a lick and a promise.\"", "Lifehack": "Any method of improving one's productivity or quality of life. \"I've discovered this great lifehack that lets me sleep less, but have much more energy.\"", "Lightning rod": "An individual that is a common target.", "Lights-on initiative": "A key project that is necessary to keep the business afloat, or the 'lights on'. \"Until further notice, I need every soul committed to our lights-on initiatives.Suggested by Al D.", "LIHOM": "Legend In His/her Own Mind.", "Line of sight": "A clear view of the goal/target. Helps you bring a little battlefield to the boardroom.Suggested by RADEY.", "Link in": "To connect or consult with others.", "Lipstick on a pig": "An attempt to put a favorable spin on a negative situation. \"Tim's sales numbers are terrible. Even he can't put lipstick on that pig.\"Suggested by Ben S.", "Locked and loaded": "Ready to execute a plan or contract. Best used to describe clients who are flush with cash and/or wasted drunk.Suggested by Julian G.", "LOMBARD": "Lots Of Money But A Real Dumbass.", "Long con": "Working for years at a job you should have never been hired for, without any oversight, accountability, or line of communication.", "Long-game": "In the long term. \"See, I understand how things work Long-Game.\"Suggested by Iain.", "Loop-in": "To apprise. \"Loop me in on the latest market numbers.\"", "Loose-Tight model": "An excuse to avoid the work of defining guidelines/boundaries, but then blocking suggestions out of perceived risk and fear.Suggested by Betina N.", "Lose the bubble": "To forget about or neglect. \"I've lost the bubble on the Henderson account. Where do we stand?\"Suggested by Christine C.", "Lost in the sauce": "Describes someone lacking direction and a clear job definition. \"Make sure the new recruits don't get lost in the sauce.\"Suggested by Lost French.", "Low decision latitude": "The inability to make any important choices.Suggested by Paul M.", "Low-ball": "A very low offer. \"They heard about our layoffs and started low-balling on their service renewals.\"", "Low-hanging fruit": "Relatively simple problems that can be addressed with minimal effort.Suggested by Phil", "Luck surface area": "Conscious efforts to increase the likelihood of positive chance events. Pseudo-profound boss says, \"Cultivate serendipity by expanding your luck surface area.\"", "Luddites": "People who are hesitant to adopt new technologies. For many, this is a point of pride.", "Lunch and Learn": "A management trick for adding an extra hour to your workday by holding meetings during lunch. A food bribe may be offeredSuggested by Kurt.", "Macromanager": "A manager that tries to direct matters outside of his department.", "Mad money": "Capital that moves quickly and unpredictably.", "Magic bullet": "The mythical perfect solution to a given business problem.  \"There's no magic bullet to collateralized debt securitization.\"Suggested by Steve B.", "Major player": "A person of influence and power within a given group. \"So who are the major players at the table?\"Suggested by David.", "Make waves": "To cause conflict or argument.", "Making sausage": "When employees discuss potential financial gains from a customer, in the presence of the customer. \"The next time I catch you making sausage in front of a client, you're fired.\"Suggested by Dan.", "Malicious obedience": "The act of following a boss's instructions explicitly, while hoping for failure. It can also involve remaining quiet about any discovered mistakes or poor judgment.", "Management porn": "A long slide presentation of useless facts and figures, created to distract managers and give them something to salivate over.Suggested by Scott.", "Marinate": "To allow some time to consider an idea privately. \"I'll just let that one marinate… Catch you on the circle back tomorrow am.\"Suggested by Richard", "Market-facing": "A role that requires interaction with clients. Contrast with the funny-looking bunch relegated to the back office.", "Marketecture": "Technical advertising, usually including diagrams. \"Make sure their techies get our latest piece of marketecture.\"Suggested by Matt F.", "Matrices": "A random diagram used to justify dubious calculations. \"If we pause to consider the matrices…\"Suggested by samuel", "Matrix team": "A group assembled from diverse departments to solve a complex problem. \"Pull in a matrix team so we're covered-off end to end.\"", "McJob": "A demeaning or low ranking position.", "Meanderthal": "A person who has difficulty expressing themselves succinctly. They often give long, unfocused presentations.", "Meat and potatoes": "Basic or traditional. \"Your meat and potatoes approach isn't going to work with this crowd.\"Suggested by Mrs. B. Trellis of North Wales.", "Meat on the bone": "Profits. \"Give me a month. One good land will put more meat on the bone.\"Suggested by Catherine M.", "Meeting assassin": "Someone who hijacks a meeting with excessive questions or endless follow-on observations. See also: Dr. Freeze.Suggested by Gary D.", "Meeting fill": "Employees that have limited knowledge, but are attentive and deferential. Prized by ineffective managers everywhere.Suggested by Rob H.", "Melt-down": "Complete product failure.", "Meritocracy": "An organization in which the success of individuals is claimed to be based only on their aptitude.", "Meta ignorance": "Being unaware of what you don't know. A common problem for managers and politicians.", "Mickey Mouse": "A trivial solution.", "Milk": "To take advantage of a favorable situation. \"Andrea's really milking the fact that she's the boss's daughter.", "Mission critical": "Something that is vital to the success of an organization. Easy on the army lingo, solider.", "Mom-and-pop": "A small-time operation.", "Mommy track": "The dead-end career path on which those with family responsibilities sometimes find themselves.", "Monday morning quarterback": "A person who offers criticism only after something negative has occurred.", "Moonshot Division": "The internal group that works on difficult and risky projects (that have a huge potential return).Suggested by Jeff B.", "Mouse potato": "The modern cousin of the couch potato. They typically spend hour after hour in front of the computer.", "Move the needle": "Tangible progress. \"You talk about efficiency, but when are you going to actually move the needle?\"Suggested by Jeremy.", "Move things forward": "A generic way of saying 'get something done', without actually having to think about what that entails.Suggested by Paul G.", "Moving the goal posts": "Changing the parameters of an ongoing project. \"How can we hope to deliver on time if the client keeps moving the goal posts?\"Suggested by Thomas.", "Mucus trooper": "Your colleague that always gets the worst colds, yet still makes it in to work to cough it all over you.", "Multi-slacker": "A person who can perform many unproductive things at the same time. These include phone conversations, instant messaging, and web surfing, often on company time.", "Muppet shuffle": "The shifting of under-performing or troublesome employees to other unsuspecting departments.Suggested by David.", "Mushroom principle": "A management practice that involves keeping subordinates in the dark and feeding them shit.Suggested by Elliott.", "My understanding": "A fine bit of rhetoric that avoids committing to a yes/no answer. \"Is it black or white? Well my understanding is black.\"Suggested by Henri", "Nail jelly to the hothouse wall": "To achieve the impossible.Suggested by Biz and Dix.", "Negatron": "A person who sees the downside in every situation. See also, Negative Nancy. \"OK Negatron, let's keep it constructive...\"Suggested by kramtronix.", "Net-net": "The verbally communicated summary of a lengthy event. \"Just give me the net-net of your conversation with the client.\"Suggested by Carey.", "New guy gene": "The polite and friendly attitude that most new employees show, at least until they learn what they can get away with.", "News sandwich": "A lunch break spent catching up with the latest online news instead of actually eating. Headlines = White collar crack.Suggested by Johnny S.", "NIMBY": "Not In My BackYard.", "Ninth inning": "A term borrowed from baseball which refers to the last minute. \"That takeover bid was completely ninth inning.\"", "No scraps hit the floor": "Competitors will always replace inefficient firms.", "Nontreprenuer": "An executive who demands growth from his team, but is afraid of taking risks.Suggested by Alan J.", "Noodle": "To think about an issue. \"Let me noodle it over this week and I'll get back to you.\"Suggested by Kate.", "North of": "More than. \"Our latest sales figures were north of seven figures.\"Suggested by Don R.", "Not my first rodeo": "Implies deep experience. The speaker wants you to acknowledge this, but likely still expects you to do all the work.Suggested by Dave B.", "Not the long pole in my tent": "Something of relatively low importance.Suggested by David.", "Not wearing trunks": "The liars exposed when the true nature of a group is revealed. You have to drain the pool to see who forgot their suit. \"If the Euro collapse gains traction, we'll be looking at a lot of bathers not wearing trunks.\"Suggested by Lou", "Nut-up": "To gather one's courage. \"Just nut-up and finish the presentation!\"Suggested by Fifi.",  "O'clock": "Shorthand for a meeting at a specific time. \"I can't touch my 3 o'clock so let's call this a hard stop.\"", "O'dark thirty": "Far too early in the morning. \"So the boss calls up and schedules a meeting for O'dark thirty.\"Suggested by brad\", \"After I ran into Helen at a restaurant, I realized she was just office pretty.\"", "Offline": "Used in business meetings to reference a more detailed discussion that won't involve the whole group. \"Let's dialogue about these issues offline.\"", "Old boys club": "A tight network of longstanding business relationships.", "On point": "A military term referring to the first and primary person involved in a given situation. \"You're on point tomorrow with the Mexican clients.\"", "On the air": "Reachable by email or phone via a mobile device. \"I'm out of the office but I'll be on the air all afternoon.\"Suggested by Jeff.", "On the carpet": "In trouble. \"I called Johnson on the carpet the other day; he really tanked in that meeting with the client.\"", "On the cheap": "To do something at a low cost. \"No expense account for this trip. We're going to have to do it on the cheap.\"", "On the map": "Well known.", "On the take": "Accepting unethical money.", "On your plate": "The work currently assigned to a given employee.", "Onboarding": "1) The process of garnering support for a project. 2) Familiarizing a new hire, which often includes orientation, filling out tax forms, training, obtaining key cards, etc.Suggested by Matthew H. and Jon.", "One throat to choke": "Dealing with one large supplier for many items. Then if something goes wrong, there is only company to rage at.", "One-man show": "A business with a single proprietor.", "One-two punch": "A borrowed boxing term meaning two actions taken immediately after each other.", "Open skies": "Universally available.", "Open the kimono": "Revealing confidential business information. The term would probably be more offensive if it wasn't usually one overweight, middle-aged man asking another to open his kimono. \"You'll have to open the kimono on your IP before engineering will sign off on the deal.\"Suggested by Grushenkaman.", "Operationalize": "To do. Now was that so hard?", "OPM": "Other People's Money. You down with OPM?", "Optics": "How something appears. \"I understand the optics of this situation, but despite how it looks, we have not acted inappropriately.\"Suggested by Karen M.", "Org chart": "A graphical representation of an organization's hierarchy. \"If there's only two people above me on the org chart, why do I have six telling me what to do?\"", "Organic growth": "Expanding a business from within using existing workers... and nepotism!Suggested by Conan B.", "Organizational awareness": "Familiarity with the things that are (or supposed to be) commonly known throughout an organization. \"What do you mean you don't have our mission statement memorized?\"", "Organizational DNA": "A cute analogy relating the four basic units of genetic code with the elements of successful management. Some call these \"decision rights, information, motivators, and structure\", others, \"factual, conceptual, contextual, and individual,\" but both are guilty of repackaging established knowledge under a trendy new buzzword.", "Organogram": "Organization chart. \"Where would you place yourself on the organogram in the near-term?\"Suggested by Will Blackstock.", "OT mail": "OverTime-mail. The practice of sending your boss a superfluous email, just to let him know how late you were working.", "Out of bed": "In a state of disarray or misalignment.  \"Call in a hot delivery because we're totally out of bed on that order.\"Suggested by Emily C.", "Out of the box": "Describes the abilities of a product immediately after purchase without any upgrades or integration. \"What can this software do out of the box?\"Suggested by Matt F.", "Out of the woodwork": "A surprise appearance.", "Out-of-pocket": "Unreachable. \"I'm boarding the plane, so I'll be out-of-pocket for a few hours.\"Suggested by Jim.", "Outbeat ": "Like beating a competitor… but more so, apparently. \"Hammer your leads and outbeat those clowns.\"Suggested by Nick", "Outside the box": "A creative solution that avoids a traditional or common approach. The 'box' concept has started to lose all meaning now that everyone claims to be outside of it.", "Over-the-shoulder time": "An informal training or review session conducted in-person. \"Drop by my office for a little over-the-shoulder time.\"Suggested by Corey S.", "Ownership": "An employee's realization that he is ultimately responsible for the success of a given endeavor. You may even convince him that it was his idea in the first place.Suggested by Mrs. B. Trellis of North Wales.", "Oxygen-move": "The act of 'breathing new life' into a project or business. \"Your team's productivity is down; we need an oxygen-move to keep things moving forward.\"Suggested by Matt.", "PAC": "Perfectly absolutely clear. \"… and I want to be completely P A C on this.\" That is some fine abbreviation irony, right there.Suggested by Jim J.", "Pacesetter": "A product or company that dictates market standards.", "Paddle on both sides": "To apply the maximum effort to a task. \"There's no delicate way to put this, but your work-canoe is going in circles. Time to paddle both sides.\"Suggested by egi", "Pain point": "An area of pressing customer need. Addressed, of course, by your company's latest product offering.Suggested by our spies at a Fortune 100.", "PanAm": "To take over; hijack. \"We were enjoying a casual, light-hearted lunch until Donna came by and totally PanAm'd it with her work talk.\"Suggested by Kellie", "Paper": "To document a position or transaction. \"We verbally agreed to a rebate, but it hasn't been papered yet.\"Suggested by Tax Goddess.", "Paper cut": "A minor negative impact. \"Five reps called out this morning so expect a few paper cuts when the call volume spikes.\"", "Paper shredder": "Another on the long list of derogatory ways to refer to accountants.Suggested by Philip A.", "Parachute in": "To send someone to complete work at an off-site location. \"The client's legal staff are clueless so I'll parachute someone in next week.\"", "Parking lot": "To end the discussion of a particular item in a meeting with the intention of addressing it later. \"We ran out time and had to parking lot Tim's marketing ideas.\"", "Party line": "Official position. \"I just can't swallow the party line on these environmental standards.\"", "Path forward": "A dramatic metaphor for what's probably a mundane business plan.Suggested by Jacada.", "Pathfinder project": "A new venture in an untested area. \"This exciting pathfinder project will open new markets.\" Translation: We're new at this and making it up as we go.Suggested by Peter K.", "Pay grade": "The limit of one's knowledge or power within an organization. \"Secret monkey research? That's above my pay grade.\"", "Pay the piper": "To settle a debt.", "Payroll orphan": "A laid-off employee who will no longer be receiving a paycheck.", "Peacock": "A person who insists on displaying every award, certification, and #1-dad-plaque on their cubicle walls.", "Peanut butter out": "To distribute responsibilities among team members. \"Let's meet tomorrow to peanut butter out the tasks.\"Suggested by Kristine.", "Pearl diving contest": "An incentive program to increase sales.", "Peel the onion": "To remove all superfluous layers and get to the heart of an issue.", "Peer management": "The art of interacting with difficult coworkers.", "Pen-down strike": "A protest in which employees are physically present, but complete no actual work.", "Pencil-whip": "To falsify records or submit a form with fabricated information. \"I pencil-whipped the survey so management would take it seriously.\"Suggested by Brandon C.", "Penetration pricing": "The practice of setting a low price initially in order to gain market share.", "Penny ante": "Something insignificant.", "Percussive maintenance": "The common practice of 'fixing' a piece a equipment by smacking it repeatedly.", "Perfect storm": "Unlikely event where all possible business challenges converge at once. Often used as an excuse for poor results.\nSuggested by MrApples", "Phase Two": "While it once referred to a concrete part of a given project, it is now used to shelve unrealistic ideas. \"That's more of a phase two idea, Jill.\"", "Phenomeniche": "A product or idea that is not widely known, but completely dominates a single highly-focused market.", "Phone it in": "To complete a task without much effort. \"She's really phoning it in on this one.\"", "Phone shui": "In thick buildings, this is the art of adjusting the placement of your cellphone to find a signal.Suggested by Grigori.", "Photox": "Improving the appearance of one's face in a using photo editing software.", "Piece": "A very trendy way to describe any issue or project. \"Where are we on the recruitment piece?\"", "Pig in a python": "Slow moving.", "Pigeon": "1) Someone that is easily deceived. 2) An absolutely useless and clueless employee. \"What were they thinking hiring this pigeon?\"Suggested by Kevin L.", "Piggyback": "To add to a previously stated idea. This is a common occurrence in meetings and business school classes, where the idea is usually just repeated using different wording. \"I'd like to piggyback on Kim's analysis of this case...\"Suggested by Reza.", "Pilot fish": "A junior-level manager that closely tails a senior executive.", "Pin the rose": "The act of selecting someone to perform a thankless task. \"Head downstairs and find me an intern that I can pin this rose on.\"Suggested by Jeffrey.", "Ping": "To contact or notify. \"Ping the boss about this one later.\"", "Pipe, the": "The never-ending source of all work. \"I better hurry and finish this project because I've got three more coming down the pipe.\"", "Pipeline": "A salesperson's personal collection of leads. \"The first one of you to squeeze a sale through your pipeline gets a $1000 bonus.\"Suggested by Remy", "Pissing in the ocean": "An action that is hopelessly trivial or meaningless. \"Without the right equipment, we might as well be pissing in the ocean.\"Suggested by Jacada.", "Pivot": "A shift or change. \"Management has instructed us to pivot off our legacy brand message.\"Suggested by herscall", "Planful": "Describes actions taken after careful strategic thinking. \"I admire your measured and planful approach.\"Suggested by LK.", "Plug the dyke": "A small stopgap measure to prevent a big disaster. \"Issue a press release to plug the dyke before reporters start calling.\"", "Pocket call": "An unintentional cell phone call. Can often get you into trouble.", "Poison pill": "A financial move used to discourage a takeover attempt.", "Political equity": "The hope of big business that political donations build intangible value over time.", "Polling": "Repeatedly checking Internet news sites throughout the workday, in order to be the first to 'break the story' to your colleagues when something interesting comes up.", "Pooh-pooh": "To reject, turn down.", "Poor mouth": "To verbally deny that one is wealthy.", "Populate": "To fill out a paper form. \"Can you populate that expense claim for me?\"Suggested by Simon S.", "Post-mortem": "The meeting or report that summarizes everything that was learned during a completed project.Suggested by Ben.", "Power luser": "An employee who is incredibly good at accidentally screwing up his computer.", "Powerpoint Bunny": "Someone who is dedicated to the art of putting other people's hard work into cheesy, over-animated slideshows.Suggested by Alex G.", "PowerPointless": "Fancy graphics and animations in slide presentations that distract your audience instead of clarifying.", "PR&D": "The unholy union of public relations and research & development. Engineering activities performed for promotional purposes with no regard for usability, return on investment, or product application.Suggested by Mad Casual.", "Prairie dogging": "The simultaneous pop-up of several heads when something interesting is happening around cubicles.", "Pre-mumble": "The preliminary comments of a speaker. Often an attempt at humour is made.", "Pre-read": "Subject matter, memos and other materials that should be read prior to a meeting or event. \"Please forward the pre-read to my secretary before tomorrow's board meeting.\"", "Prebuttal": "To address an opposing viewpoint before it's brought up. Often interruptive, \"Now I know what you're going to say...\"", "Presenteeism": "The practice of working ridiculously long hours.", "Press on that bruise": "The act of further exposing or exploiting a known weakness to advance one's cause. \"I don't mean to press on that bruise, but…\"Suggested by Cal N.", "Press the flesh": "To shake hands.", "Pretendgineer": "A young worker who has settled for a technical job after realizing that his true passion won't pay the bills. \"He's still hoping for that record deal, but he's been a pretendgineer since graduation. I give it 6 months before the guitar's gathering dust.\"Suggested by JC & CM.", "Prethink": "Discussing an idea or proposal with a smaller group before broader delivery. \"We met to prethink our message before the call.\"Suggested by w3.", "Price point": "Although a legitimate economic concept, business people are simply happy to have a much cooler way to say 'price'. \"What kind of price point were you looking for?\"", "Proceduralize": "To make a process official. \"We're going to proceduralize this protocol into a coherent business model.\"", "Productize": "To turn into a product. \"How do we productize our experience in this sector?\"", "Programmatically": "To complete a task with the help of a software tool. \"I want to be able to track our shipments programmatically.\"", "Progressive elaboration": "The process by which a mediocre project is continuously modified via trial and error with the hope that it is improving.Suggested by Jon B.", "Project creep": "The ongoing extension of a deadline by small increments.Suggested by Brian C.", "Promoted to customer": "Fired. \"Didn't you hear? Melanie was promoted to customer last Friday.\"Suggested by Gregg.", "Pucker factor": "The degree of reaction to something that is startling or unexpected. Better not to think about the origins of this one.", "Puff piece": "An article that is purely hype.", "Pulse": "To gather information informally. \"Pulse our liaisons for any changes to our contact lists.\"Suggested by Jordan M.", "Pulse check": "A short meeting to discuss the status of an ongoing project. \"I've got a repeating tickler on the Tuesday pulse check.\"Suggested by Tonina", "Pump and dump": "To pad a list price higher so that the net profit is still palatable after a large discount is applied. \"Who negotiated this corporate account? I had to pump and dump all my quotes to those guys.\"Suggested by Colin M.", "Punch the tree": "To vent anger at an inanimate object in lieu of the person who caused it. \"Take five, punch the tree, and come back in here with a clear head.\"Suggested by Tom NWC.", "Pushback": "The opposition that one's ideas face from the rest of the company.", "Pushing rope": "A fruitless task. \"You've wasted half your career pushing rope.\"Suggested by Jon B.", "Put the acid on": "Applying negative pressure to motivate an individual or group. \"R&D has gone full-on fantasyland. Time to put the acid on.\"Suggested by Lea C.", "Put to bed": "To conclude something. \"We just need to put these last issues to bed.\"", "Put your feelers out": "To assess a situation using information gathered from one's professional network. \"Why don't you put your feelers out to gauge the partners' interest in our latest initiatives.\"", "Putting socks on an octopus": "Attempting an impossible task. \"Closing these latest prospects is like putting socks on an octopus.\"Suggested by Mrs. B. Trellis of North Wales.", "Q1": "A slick way to say 'first quarter'. Similar usage for the other three quarters is also encouraged.", "Queen of the pigs": "The best of a bad breed; the number one loser. \"He's not that bright but he's queen of the pigs in that organization.\"Suggested by Bob M.", "Quick win": "Guaranteed success within a short period of time, often through capitalizing on misfortune. \"Look for a quick win on wheat futures over Egypt unrest.\"Suggested by Dom.", "Race without a finish line": "A frantic effort without a clearly defined goal. \"I see you clowns racing, but where's the damn finish line?\"Suggested by Mark N.", "Raft of measures": "A group of solutions launched concurrently. \"Let me assure you that we will float out a raft of measures to correct this imbalance.\"Suggested by Michael D.", "Ramp up": "To increase over a period of time.", "Rasterbator": "A person who uses photo-editing software compulsively.", "RDB": "Rectal DataBase. The origin of ideas that are pulled out of one's ass.", "Re-inventing the wheel": "Hard work that can be avoided by simply stealing the solution from someone else.Suggested by Julie.", "Reach out": "To contact. A dramatic way of saying a very mundane thing. \"I'll have my people reach out sometime next week.\"Suggested by Denis", "Ready, fire, aim": "Releasing a product that isn't ready just to meet an arbitrary deadline or impress investors. \"Come on...  ready, fire, aim. We'll fix it in post.\"Suggested by Mr. Planner.", "Real-time": "Voice communication (as compared to email and text). \"75 reply threads and you're still nowhere. Get on the horn and deal with this in real-time.\"Suggested by Jeff.", "Recontextualize": "To redefine an organization's role in a given business environment. Who can actually say this word with a straight face??", "Rectible": "A larger, rectangle shaped cubicle usually given to team leaders.Suggested by Jeffrey.", "Red flag": "Warning sign.", "Reduction in Force (RIF)": "One of the many euphemisms used to describe firing people.", "Referenceability": "A measure of a firm's ability to gather positive references and case studies from its clients.Suggested by Lisa G.", "Rent-a-quote": "\"Experts\" for hire that are prized for their ability to provide convincing sound-bites.", "Repeating tickler": "A recurring calendar event with a reminder alarm.", "Report": "A subordinate. \"By this time next year, you'll have a small army of direct reports.\"", "Repurpose": "To redefine how an item is used, often as an alternative to discarding it. \"If we don't repurpose this production line, we're going to waste $2 million in capital.\"", "Resonate": "To appeal to someone on a fundamental level. \"This new model will really resonate with the youth market.\"", "Resource": "References anything that will be used to complete a task, whether it be a stapler or a person. Helps managers strip away the humanity from their employees before making hard choices.Suggested by Renee.", "Resource-intensive": "Expensive.", "Responsibility curve": "The collection of things for which one is responsible. \"Accounts Receivable is not part of my responsibility curve.\"Suggested by Dave C.", "Resume stain": "A job (or company) that looks so terrible that you'd rather leave it off your resume.", "Retired in place (RIP'd)": "Describes a 'tenured' employee who still holds a position, but generally does nothing but count the days until retirement.Suggested by Mark D.", "Retread": "To implement a failed idea for the second time.Suggested by Matt F.", "Reverse infallibility": "Describes a person who is always wrong.Suggested by Just Some Poor Schmuck", "Reverse logistics": "The return of a faulty product to the manufacturer. \"Make sure the reverse logistics are as complicated as possible for the customer.\"Suggested by fhunktion.", "Ride herd": "From a cowboy expression meaning to observe and control closely. \"Jill, I need you to ride heard on this project.\"Suggested by aclassicgirl.", "Right seat on the bus": "Responsibilities that complement the skills of those assigned. \"We want to hire you, but just can't seem to find the right seat on the bus.\"Suggested by Jeremy.", "Right-shoring": "Distributing operations to the most profitable location, instead of assuming that offshore options are inherently superior.Suggested by Aaron D.", "Rightsizing": "A gentler way to refer to downsizing. Suggests that a round of layoffs is simply a labor surplus correction, rather than a symptom of deep financial problems.", "Road map": "A plan for dealing with upcoming business challenges.", "Robust dialog": "A productive conversation between co-workers involving open, honest discussion. Usually this translates to two assholes shouting at each other.Suggested by Christina.", "Rocket surgery": "A delightful way to combine two points of comparison when discussing the difficulty of a task. \"Come on, it's not rocket surgery.\"Suggested by Jon K", "Rocking a pair of doobs": "Wearing boat/deck shoes (Dubarrys) in a business setting.Suggested by Chrissie.", "Rocks in the backpack": "The individual responsibilities that make up a person's total workload. \"Can't help you. I've got enough rocks in my backpack.\"Suggested by Leah.", "Roll in": "When telling a story about a late coworker, this is the only acceptable way to describe their arrival. \"Typical Millennial... rolls in at 10:45 without saying a word.\"", "Rolling the tortoise": "Excessively increasing resources to accelerate an otherwise slow-moving project. \"Pull in ten extra bodies to help roll the tortoise.\"Suggested by Nigel.", "Rolling thunder approach": "Creating a constant media buzz.Suggested by Atticus I.", "Rooster call": "An early morning meeting scheduled well before normal working hours. Breakfast optional, but they best be brewing coffee.Suggested by Gene R.", "Round file": "The garbage pail. \"This sales brochure is going straight into the round file.\"", "Row back": "To retreat from a position. \"You can't expect B.O.D. row back with so many shareholders pushing for no confidence.\"", "Royal jelly": "1) The substance that bees rub onto an immature female to cause her to transform into a queen.2) The flashy projects and good assignments that are constantly fed to someone the boss is grooming for promotion.\"Debra's been getting a ton of royal jelly lately, you think she'll remember us when she makes VP?\"Suggested by Randy D.", "Rub my rhubarb": "To be irritated in a particularly annoying or painful way. \"These whiny new interns are really starting to rub my rhubarb.\"Suggested by Luke K.", "Rubber check": "A bounced check.", "Rubber stamp": "Approval. \"Can I get your rubber stamp on this one?\"", "Rube Goldberg": "Describes an inefficient and overly complex solution.", "Rug ranking": "When the career of an assistant is tied to that of his or her boss.", "Run it up the flagpole": "To find out what colleagues think of a new idea.Suggested by Patti", "Runway": "The amount of time left before a startup runs out of money. \"You've got a 5 month runway—don't waste it.\"Suggested by Tim C.", "Sacred cow": "A program or product that may be unprofitable, but cannot be questioned.", "Sacrifice": "Yet another gentle name for firing people. \"We'll have to sacrifice a few customer service positions.\"", "Safe harbor": "The office bathroom. Often the only place to find a moment of peace at work.", "Salesblazer": "The main way that tech and artist types dress up their jeans-based style when meeting clients or presenting.", "Salt mine": "Menial work.", "Sandbag": "1) An unethical attack.  2) A tactic used by salespeople where closing a sale is purposely delayed into the next month to improve their overall commission.Suggested by Ryan.", "Sausage and the sizzle": "Used by sales when comparing substance (sausage) versus marketing spin (sizzle). \"John you've got the sausage, but where's the sizzle?\"Suggested by Guy from Melbourne.", "Scab": "A union term for undesirables such as strikebreakers and non-union employees.", "Scarlet letter": "A symbol of shame.", "Scooby Snacks": "Token compensation. \"The gift certificates they gave us instead of a Christmas bonus were total scooby snacks.\"", "Scope creep": "The tendency of a project's purpose to expand to suit the ambitions of the pushiest stakeholder.Suggested by Ellen B.", "Screw the pooch": "To avoid doing anything productive. \"Are you going to sit there and screw the pooch all day?\"Suggested by Natalie R.", "Scrub": "An entry-level employee. Usually replaceable.", "Scuttlebutt": "Gossip or rumors.", "Sea legs": "The point when a new arrangement becomes stable and comfortable. \"We're still establishing our freemium sea legs…\"", "Seamless": "Describes a system so well integrated that it seems like a contiguous whole. Even if it's all held together with paperclips and chewing gum inside.Suggested by Robert S.", "Second .coming": "The re-emergence of Internet business as a viable way to make money.", "Security theater": "A very visible display of security to compensate for a true lack of it.", "Sense check": "The process of ensuring that something 'makes sense'. \"Can you sense check the second paragraph? Not sure if I'm being clear.\"Suggested by Simon H.", "Serial entrepreneur": "A person who starts several (not necessarily successful) business ventures.", "Serving suggestion": "A recommended quantity (not food related). \"Hit me up with a serving suggestion on the social media ad buy.\"Suggested by B. Potter.", "Shanghaied": "1. Forced to work a job on a ship overseas.2. Forced to watch your job as it's shipped overseas (to China).", "Sheep dip": "A tedious corporate briefing where attendance is mandatory and recorded for all employees.Suggested by Paul K.", "Sheep it": "To follow a ridiculous company policy without complaint.Suggested by Kevin.", "Shelfware": "Purchased or developed software that is never actually used. \"150 grand later and all we've got to show for it is a fancy piece of shelfware.\"Suggested by Gordon M.", "Shield time": "The time spent in a vehicle (behind a windshield) with a coworker or boss.", "Shirt size": "The quantity of effort required to complete a task, recorded as S, M, L, etc. \"Sprint kicks off tomorrow, did you clear that shirt size with the scrum master?\"Suggested by Geraldo.", "Shoot the puppy": "To take an unpopular action. \"We have to shrink the department, but I don't want to be the one to shoot the puppy this time.\"Suggested by Graham.", "Shotgun approach": "A wide, untargeted strategy.", "Shoulder tap": "An informal request made in passing. A good reason to avoid the boss in the elevator, hallway, kitchen, parking lot, and the bathroom. Especially the bathroom.Suggested by Fuehrer.", "Show coach": "A manager who claims to lead by example.Suggested by Thomas L.", "Show pony": "Someone who superficially presents well but lacks real depth. \"The conference floor was nothing but show ponies and booth babes.\"Suggested by Tony.", "Shrink": "Retail losses from shoplifters.", "Sidebar": "A whispered conversation between co-workers during a meeting or presentation. \"Don't let me interrupt your little sidebar ladies, but we have 30 more slides to get through.\"Suggested by Trickyn.", "Sideways": "The direction of failure. \"If this launch goes sideways, they'll liquidate the entire department.\"", "Signature basis": "Solely based on one's name and reputation.", "Silo": "The set of responsibilities assigned to a given employee. \"I'm sorry, customer service is outside my silo.\"Suggested by Lee K.", "Silver bullet": "An infallible business solution.", "Silver ceiling": "The barrier to promotion that many older employees face.", "Simmer": "To allow time for an idea to be fully considered. \"Give them a week to simmer before you pull their feedback.\"", "Single pane of glass": "A marketing claim that everything can be monitored and controlled from one display. \"Networking perfection. On a SPOG.\"Suggested by Ray B.", "Skiing off-piste": "Completing a common task in an unconventional manner, usually at great personal risk if it all goes wrong.Suggested by Dangerous Pete", "Skills ecosystem": "The total collection of individual team-members' skills, which are hoped to be mutually supportive.Suggested by Darren F.", "Skillset": "A collection of abilities, commonly matched to a set of requirements. Even more commonly embellished by job-seekers.Suggested by David.", "Skip-level meeting": "When a member of senior management meets with low-level workers directly to see who's brave enough to ask a question (or offer dirt on their supervisors).Suggested by Kurt.", "Skull session": "A collaborative meeting to generate new ideas (a brainstorm by any other name…). \"Skull session. My office. Oh-nine-hundred.\"Suggested by Brendan", "Slave trader": "An affectionate term for the human resources department.Suggested by BitHacker.", "Sledule": "A project schedule that continually slides to the right due to poor planning and underestimated tasks.Suggested by Kenny B.", "Small cap": "Insignificant or low priority. \"You're a small cap man and you think small cap.\"", "SME": "Subject Matter Expert. The resident guru for a given topic. \"I can't remember how to work this damn photocopier. Who's the SME for this machine?\"Suggested by our spies at a Fortune 100.", "Smell test": "A disgusting little term for using common sense to make a quick judgment. Anyone else cringe every time you see it in print?", "Smirting": "Taking the opportunity to flirt with co-workers while huddled together for an outdoor cigarette break.Suggested by John I.", "Socialize": "To facilitate group discussions about an issue. \"Let's give them time to socialize the new material with their teams.\"Suggested by Asiya.", "Soft pedal": "To give a false impression that progress is being made. \"We soft pedaled the client to buy us an extra week.\"", "Soundbites": "Key points delivered as a quick summary. \"Stop running your mouth and just give me the soundbites.\"Suggested by Ronnie I.", "Soup to nuts": "From the start to the end of a project, in reference to the first and last courses of a formal meal.Suggested by Jonathan S.", "Space": "A really douchey way to refer to a market or industry. \"We're looking at full saturation in the tablet space by Q3.\"Suggested by Corinne F.", "Speak to": "To address. \"Yield the floor, sir, and I will speak to your point!\"", "Speaker-phone voice": "The characteristic volume level that people feel they must use when on speaker-phone.", "Speaks to": "1) Evokes: \"This image speaks to the bravery of the troops.\" 2) Represents: \"The bold font in our logo speaks to the fact that we're bold.\"Suggested by Mike T.", "Special Projects": "Tasks given to formerly favored executives that have screwed up. Lets them pretend to have a real job while looking for a new position.", "Special sauce": "Anything of a proprietary nature.", "Spend": "An amount of money paid out. \"What was our total ad spend last month.\" ...And I'm spent.", "Spitball": "1) To estimate. 2) To conceive an idea; brainstorm. \"Let's run through your sales deck and spitball a new angle.\"", "SPOC": "Single Point Of Contact. \"I'll have my SPOC get in touch with your SPOC.\"", "Spokesweasel": "A public relations agent.", "Squeeze the sponge": "To extract every last bit of knowledge that an employee gained during a company-funded training event. \"Let's review your conference notes. I want each department to sit down with you and squeeze the sponge.\"Suggested by Jon F.", "SSSD": "Same Shit Same Day. Working the third shift often means leaving at 6AM and returning the same calendar day at 10PM, only to encounter the SSSD.Suggested by JC.", "Stakeholder management": "The art of acquiring enough opinions from people, groups, or leaders within a company to deflect blame if a project doesn't meet expectations.Suggested by Laurie R.", "Stakeholdering": "The process of seeking support, approval, or clients for an upcoming project. \"I spent the entire Christmas party stakeholdering upper management on my Q1 initiatives.\"", "Stall nap": "A short, pants-optional sleep taken in the office bathroom.", "Standing room only": "Where buyers are led to believe there are many others interested in an item.", "Starter marriage": "A brief first marriage ending in divorce.", "Statistical massage": "To present numbers in a way that conveys a desired message.", "Stealth parenting": "Running errands for your kids after telling your boss that you have a business obligation.", "Stepford Worker": "An employee that has bought the corporate party line completely and become an unthinking clone.", "Stick to your knitting": "1) To focus on one's main areas of business, often at the expense of other departments.\r\n2) To be steadfast.", "Stick-around": "A meeting that takes place directly after another, in the same location. \"We had a two hour stick-around after the project meeting yesterday.\"", "Strap-on": "To try something. \"Before you judge my idea, why don't you strap it on for a while.\"", "Strategic incompetence": "Feigning an inability to complete a particularly boring or demeaning task.Suggested by EC Nottus", "Strategic planning": "Pointless tautology used when the word 'planning' doesn't quite sound impressive enough by itself.Suggested by Rob.", "Stress puppy": "A person who is continuously anxious and lives for any sympathy gained from complaining about it.", "Stretch assignment": "A project given to an employee that is just beyond their current skill level. Neatly avoids the cost of an actual promotion.Suggested by Robert", "Sunset": "To slowly retire a product line. \"We need to sunset last year's model over the next two months.\"Suggested by Johnny P.", "Sunshine enema": "After massive layoffs, this is the spin campaign given to the remaining shell-shocked and fear-crippled employees.Suggested by Tom T.", "Super": "Supervisor, for those who are too lazy to say the whole word.", "Surface": "To raise an issue. \"Don't forget to surface your concerns with the VPs.\"", "Surplused": "Yet another way to describe being fired. \"We surplused a few people last week.\" Good lord.", "Swampland in Florida/Arizona": "A sarcastic offer made in response to perceived gullibility or ignorance. \"If you believe that, I've got some prime swampland in Florida to sell you...\"", "Sweat equity": "An intangible asset earned by the hardworking, under-paid employees of small start-up companies. \"I know I can't exercise the options until next year, but the 80-hour weeks are building swequity.\"", "Sweat the asset": "Getting the most out of your hard-working employee. \"Our productivity systems ensure that you sweat the asset to the max.\"Suggested by LW.", "Sweetheart deal": "An arrangement where existing clients receive more favorable terms than new clients.", "Swim lane": "1) A visual element showing task assignments in a process diagram.2) Field of responsibility. \"Listen, client management just isn't in my swim lane.Suggested by Chad.", "Sympvertizing": "Advertising that attempts to sympathize and identify with the consumer.", "Syndicate": "To distribute a document or idea to collect feedback. \"Make sure you syndicate that pitch deck to the whole cap table.\"Suggested by Ian S.", "Table": "To set an issue aside. \"We have to table your complaints for now and come back to them when we have more time.\"", "Table stakes": "The minimum resources needed to enter a market. Occasionally misspelled as \"table steaks\", causing confusion and hunger.Suggested by Amanda", "Tacit knowledge": "Information that only exists within the head of an employee(s). The challenge is to make sure it's recorded before they resign.", "Tactical": "Concerned with low-level details and execution. \"Don't tell me you're an 'ideas guy' when your team is begging for tactical leadership.\"Suggested by Chris K.", "Tailwinds": "Positive market conditions that favor success. \"We're going to capitalize on current tailwinds to carry us into next year.\"Suggested by Kyle R.", "Take a bath": "To lose a significant amount of money. \"We really took a bath after 9/11.\"", "Take home": "Final net pay after all deductions have been taken off.", "Take the knock": "To sell at a loss.", "Talent": "Key skilled labor. \"Never lose sight of The Talent. Acquire it. Keep it happy. Full stop.\"Suggested by Scott", "Talk to": "A self-important way of saying 'talk about'. \"Next I'm going to talk to the issues raised last week.\"Suggested by Dave", "Talk turkey": "To converse in a serious way. \"Step into my office so we can talk turkey.\"", "Tall Foreheads": "1) A swipe at older white men with receding hairlines who predominate most senior management teams.2) Experts or intellectuals.\"I made the pitch to a room full of Tall Foreheads.\"Suggested by Michael A.", "Tangentery": "Distracting side topics. \"Let's not get off into tangentery again.\"Suggested by Jargo Girl.", "Tap dancer": "A person who seems busy and productive, but stays in pretty much the same place.Suggested by Tony.", "Tart up": "To artificially increase the attractiveness of something. \"I think their auditing firm has been tarting up the financials again.\"Suggested by September F.", "Tasked": "To be given an assignment. \"I've been tasked with bringing coffee to the meeting.\"Suggested by Randi H.", "Tassel-loafers": "Construction site visitors that can be identified as upper management by the style of their shoes.Suggested by Chad W.", "Tee up": "To provide a natural transition point; to make preparations. \"Your question tees us up nicely for the next presenter...\"Suggested by Kelly B.", "Teflon shoulders": "The coworker who always manages to wiggle out of assignments. \"Total immunity to delegation, this guy. Nothing sticks.\"Suggested by PJ", "Testiculate": "To wave one's arms while at the same time, talking bollocks.Suggested by Tom P.", "That dog won't hunt": "That plan won't work.", "The juice is not worth the squeeze": "The pain or sacrifice outweighs the expected benefits.Suggested by Cool rockin' daddy.", "Think the unthinkable": "A meaningless challenge.", "Three-martini lunch": "A business meal with multiple alcoholic drinks. Can be used to help the sales process along.", "Throw the dolly out of the pram": "A childish, inappropriate outburst in response to frustration. \"Now don't throw the dolly out of the pram here; calm down and let's talk about this rationally.\"Suggested by Carol F.", "Throw under the bus": "To avoid responsibility for a mistake by blaming someone else. \"That bitch from finance really threw me under the bus.\"", "Tiger team": "A temporary group of \"experts\" assembled to convince management that everything is under control.Suggested by Krystina S", "Time pig": "A useless project that will require countless hours. \"I can't stomach another time pig vanity bid.\"Suggested by Jonathon T.", "Time-poor": "Lacking free time.", "Timeframe": "A vague and flexible measure of time. \"We're looking at a Q2 to Q4 timeframe.\"Suggested by Ski.", "Tips and pearls": "Brief pieces of advice and wisdom. \"We provide a broad-base consult to really capture those tips and pearls.\"", "Title sponsor": "A company that attaches its name to a building, event, or anything else that will take their money.", "TLA": "Three Letter Acronym. There's no time to say three whole words, even when complaining about acronyms.Suggested by Michael S.", "Tokenism": "Putting minority workers in visible roles in order to project an image of diversity.", "Tony Bagadonuts": "A bumbling man. \"So I'm talking to the client and all of a sudden Tony Bagadonuts shows up and interrupts everything.\"Suggested by Brad", "Toolkit": "A collection of training materials. CLAIM: Comprehensive set of tools and strategies for dealing with any situation. REALITY: Three slide PowerPoint.Suggested by Rob", "Touch base": "To get in contact with or update. \"Call me in two weeks and we'll touch base about this again.\"", "Town hall": "A meeting held by senior management for all staff, usually followed by a carefully scripted question and answer period.Suggested by Dave", "Transitioning": "An ugly verb meaning 'to undergo a transition.' \"We're transitioning to a new payroll system next month.\"", "Travel dazzle": "An attempt to impress the boss while on a business trip together.", "Tree killer": "Someone who insists on printing every email, document, and web-page they come across.", "Treeware": "Geek-speak for anything printed on paper.", "Trending over": "To increase past a projected or budgeted value, usually in reference to spent money. \"We're trending over plan on our T & E line.\"Suggested by Aaron.", "Trial balloon": "Information distributed in order to observe the reaction of colleagues or management. \"Float a trial balloon before committing budget.\"Suggested by John.", "Triangulate": "To involve a third person or party. \"The contract looks good to me, but I'll have to triangulate with Gavin in Accounts before we can move forward.\"Suggested by Michael P.", "Tribal knowledge": "Group wisdom gained over many years in a given industry. \"I'm going to hit you with some hard won tribal knowledge.\"Suggested by Erik", "Triple-dub": "The freshest way to start spelling out a website address. \"Dude, you have to hit up triple-dub dot superpizzaboner dot info.\"Suggested by Alli R.", "True North": "The business direction that leads to success. \"We've brought in some consultants to help steer us to True North.\"", "Trustafarian": "A co-worker, typically a young intern, who is from a wealthy background but dresses like a bohemian stoner.Suggested by Luke K.", "TTB": "Time to boxes. Elapsed meeting time before someone jumps up and starts drawing shapes on the whiteboard.Suggested by Dennis", "Turd polishing": "1) Putting a positive spin on an unpleasant situation.2) Efforts to make cosmetic improvements to something that is fundamentally flawed.Suggested by Derrick and Pillson.", "Turkey farm": "A division used to store the incompetent or unfireable, safely isolated from actual customer interaction. Members may include eccentric IT gurus, union reps, and your boss's teenage daughter.Suggested by Chuck P.", "Turkey trot": "Transferring a difficult or incompetent worker into another section of the company.", "Turn-key": "Describes a system that can be immediately installed and activated, without significant configuration.", "Two-comma": "Anything that costs over $1,000,000. \"We just landed a two-comma contract this morning.\"", "Twobicle": "A cubicle built for two. \"Having my own twobicle will always be the dream.\"Suggested by Marty R.", "Uber": "This borrowed German word emphasizes any adjective that it appears before. It's also a great way to sound like your teenage daughter. \"I am uber-tired today; I'm going to spend the rest of the day working from home.\"Suggested by Dave A.", "Unbundling": "To break a service package into smaller, targeted pieces. \"Our platform drives an opportunityscape for creative unbundling.\"", "Undertooled": "Lacking the tools necessary to complete a task. \"I need more training; I'm completely undertooled to operate this.\"", "Unknown unknown": "The most dangerous of business uncertainties. \"I know about the known unknowns. It's the unknown unknowns that keep me up at night.\"Suggested by Chris P.", "Unpack": "To explore or examine in detail. \"I think that we need to really unpack this concept before we pursue the idea further.\"Suggested by Melissa.", "Unscrew": "The actions required to reverse the harm caused by previous incompetent management. \"I'm not sure how we're going to unscrew things with the shareholders.\"Suggested by Lance S.", "Up sticks": "To close a location and move. \"If your team can't deliver growth next quarter, we'll up sticks and relocate the whole division.\"", "Up the pitch": "To increase the intensity of an argument. \"Don't pivot off-message… up the pitch!\"", "Upfeed": "Passing along key information to a superior. \"Just put it in your report and I'll catch it on the upfeed.\"", "Upshot": "An advantage or benefit. \"The upshot of this escalation strategy will be a 50% increase in our small arms production.\"Suggested by Heywood J.", "Upside": "Potential for a positive financial outcome. \"Stop mumbling about ethics and think about the upside. It's bonus season.\"Suggested by Lee B.", "Upskill": "To self-improve.", "Upspeak": "The grating habit of ending every sentence with a raised inflection, as if asking a question. Some valley girls become valley women.Suggested by Aaron", "Uptitling": "The practice of changing an employee's job title to something impressive-sounding in place of an actual promotion.", "Value proposition": "The collection of tangible and intangible things that your product offers.", "Value stream": "The full set of processes through which a product passes over its lifespan. Some add value, while others take it away.", "Value-add": "A typical biz speak reversal of 'added value.' \"We have to evaluate the value-add of this activity before we drop any more money.\"Suggested by Fred D.", "Vanilla": "Simple, conservative. \"Stop being so vanilla and help me shred these documents.\"", "Vapor trail": "What follows behind a coworker that uses far too much perfume or cologne. Someone should really say something...", "Vaporware": "1) Overhyped software that misses a promised release date so many times that even die-hard fanboys lose interest.2) A tactic used by salesman to sidestep your complaints by selling you the (nonexistent) next version of their product.Suggested by Jacada.", "Veal pen": "A cubicle. So how tender do you think you are at this point?", "Vector": "Move. \"We'll vector that up to the operations unit right away.\" Suggested by Kelly B.", "Velvet lip": "A gift for smooth talking. \"Who's that new PR guy with the velvet lip?\"", "Verbiage": "Descriptive writing. \"Here's the outline for our strategy in the coming fiscal year... we'll fill in the verbiage later.\"Suggested by Corinna S.", "Verbification": "See verbing.", "Verbing": "The process of transforming an innocent noun into a business verb.", "Vicious agreement": "That's a lot of agreement. \"You can drop the high-touch sales routine. We're in vicious agreement.\"", "Village hall meeting": "An unfortunate derivative of 'town hall meeting', this is a relatively small meeting held by relatively middle management. The same pretense of open discussion applies.Suggested by Dave", "Visibility to": "Access to information about a given subject. \"I can't give you visibility to unpublished earnings data.\"Suggested by Angela", "Vision": "The bold leadership direction that every manager claims, even if it changes every two weeks.", "Visioning": "Meeting to plan future directions. \"Keep your afternoon clear for a visioning session with the project leads.\"Suggested by Sarah.", "Voldis": "Volume discount. \"What kind of voldis are we talking at 1000 units?\"", "Voluntold": "Volunteered for something by a superior, when there was really no choice in the matter.Suggested by Leesy.", "Vubicle": "A cubicle that abuts a window; a cubicle with a view. When offices aren't available, it's the little things that help managers feel superior.", "Vulture capitalists": "Ruthless investors that typically wait to help liquidate the remaining assets of failed companies.", "W-cubed": "The unrealistic claim that your company can deliver whatever, wherever, whenever it's needed.", "WAG": "A Wild-Assed Guess.", "Walk together": "A close collaboration. Try to imagine your colleagues stumbling around the office in an awkward three-legged race.", "Walk-trot-run": "Describes the progressive improvement of new personnel or practices. \"I'm confident that my latest hires will be walk-trot-run by next month.\"Suggested by Mike B.", "Wallet share": "The portion of a customer's total spending that has been captured. \"This software will allow you to spot opportunities to increase wallet share on a client-by-client basis.\"Suggested by Lynne.", "Wallpaper a meeting": "To fill a conference room with people that agree with your position.", "Wallpapering fog": "Doing something useless (in the extreme). \"Tell your team to stop wallpapering fog and produce some damn results!\"Suggested by Greg.", "Warm bowl of nothing": "A project or idea that has no substance, but is sold as a great opportunity.Suggested by Jim.", "Washes its face": "Pays for itself/breaks even. \"We need to price this on a washes our faces basis.\"Suggested by hc", "Washup": "A meeting scheduled after an event to discuss what was learned and assign blame for any problems.Suggested by Lafeerose.", "Wax poetic": "To talk in what the speaker believes to be an expressive manner, often using bizarre, contrived metaphors. \"After warning us that he was going to 'wax poetic', Tim started to compare our recent union battles with the struggle for racial equality.\"Suggested by Steve W.", "Weapons grade": "Effective to the point of being lethal (not actually lethal). \"You're lookin' at weapons grade, black-belt tigerteam.\"Suggested by Mike D.", "Weighing the pig": "Endlessly analyzing a business's standpoint in terms of market share, profitability, growth potential, etc., instead of actually working on generating revenue.Suggested by Alecia.", "What the musk?!": "The proper response to the entrance of a coworker with overpowering cologne.", "Whatnot": "No matter how many times an instruction is repeated or simplified, this person will look back with glazed eyes, a blank expression and a predictable response, \"...What?\"Suggested by CM & JC.", "Wheelhouse": "The piloting room of a ship; the brain. \"The thought of going green has been rattling around my wheelhouse for some time now.\"Suggested by Paul N.", "Where the rubber meets the road": "1. A single, crucial moment on which success is dependent.2. The performance of a product after release, in the real world. \"We deploy next week. This is where the rubber meets the road, people!\"", "White smoke meeting": "Marks the point when a client approves a big contract. Just like announcing a new pope, if the pope were a cleared commission check.Suggested by Bryan", "Whiteboard": "To convey information by writing it out on a presentation surface. \"Let's whiteboard your thoughts in this afternoon's meeting.\"", "Whitehouse decision": "An issue that can only be addressed by the most senior of senior management. See: C-level.Suggested by einstein.", "Whitespace": "1) Open floor or selling space. \"Walking through the sales area, I realized we've got way too much whitespace.\" 2) Unrealized opportunity. \"We need to identify the whitespace in dental sales.\"Suggested by Eddie L. and Marie P.\", \"Widen the jaws\": \"To ensure that revenue rises faster than costs. \"Unpaid overtime won't widen the jaws forever.\"Suggested by Ronnie I.", "WIFM": "What's In it For Me (pronounced 'wiffim'). \"I understand what you're saying, but where's the WIFM here?\"Suggested by Nigel T.", "Wiggle room": "The amount of flexibility to change a profit margin. \"The competition just announced a massive discount. How much wiggle room do we have here?\"", "Win-win": "A mutually beneficial arrangement for two parties. While the better negotiator is probably still at an advantage, both leave the table feeling great about it.", "Window-licker": "An employee willing to do almost anything to impress the boss.", "Windshield survey": "Avoiding the effort required to actually get out of the car during a site visit.Suggested by Gary P.", "Witch hunt": "An all-consuming and costly search for the person responsible for a minor mistake. May be the first step in your manager's descent into madness.Suggested by Ed", "With all due respect...": "Usually spoken just prior to showing zero respect.Suggested by Russell H.", "Within a nine iron": "Relatively close to a goal. \"Get us within a 9 iron on those figures.\" How do I convert golf yards into dollars again?Suggested by Regina", "Womb to tomb": "From creation to disposal. \"You're looking at guaranteed lifecycle support. Womb to tomb.\"Suggested by Andy R.", "WOO": "Window Of Opportunity. \"John has to come in Monday; the WOO can't be changed on this one.\"Suggested by Sammy.", "Word-of-mouse": "Referral advertising over a computer network.", "Wordsmith": "A dramatic replacement for 'edit'. \"Let's capture your ideas in broad terms for now -- we can always wordsmith them later.\"Suggested by Leslie C.", "Work of Shame": "The shift following an unexpected weeknight hook-up, usually featuring the same clothes from the day before.", "Work sandwich": "The work-related sheets of paper printed to conceal personal use of the equipment.Suggested by Tangela", "Work spasm": "The short-lived period of high productivity just after a vacation.", "Work stack": "A list of assigned tasks. \"We'll need to check Jim's work stack before we task him with another account.\"Suggested by Fred D.", "Work the problem": "Pretending to address an issue after pretending to listen to a complaint. Nicely avoids committing to a specific course of action. \"Understand that we are very concerned and are doing our best to work the problem.\"Suggested by Angie.", "Work/work balance": "Making sure that your day job doesn't interfere with the time you spend chasing half-baked startup ideas.", "Workmare": "A nightmare set in the workplace, featuring extreme failure or embarrassment.", "Workstream": "A task described so vaguely that no tangible progress can be made. \"I want each member of your team to focus on one of four key workstreams...\"Suggested by Whistling R.", "Worry bead": "A bothersome subject tracked by executives on a rotating basis.  Like Rosary Beads are counted during prayers, worry bead items are discussed on a regular schedule.Suggested by Tired.", "Wow factor": "That special something that the client keeps demanding, but can never quite articulate.", "Xerox subsidy": "The practice of using the company's photocopier, printer, or fax machine for personal reasons.", "Yield loss": "A drop in productivity. \"We’re seeing white collar yield loss across all departments; it's time to block Facebook.\"Suggested by Roger S.", "Yogurt cities": "Places that have an 'active culture', meaning a large number of museums, theatres, art galleries, etc.", "Youmanity": "You + humanity. Wait, what?", "Your take": "Your point of view. \"So what's your take on these latest sales figures?\"", "Yuppy food stamps": "Fresh $20 bills from the ATM", "Zero cycles": "Lacking the free time for any additional tasks. \"It comes down to bandwidth. I have zero cycles for any of this.\"Suggested by Wolfie.", "Zero time": "The duration of tasks that management considers insignificant and so shouldn't impact your productivity when assigned en masse. Logging in takes zero time; filling out a requisition form takes zero time; A \"brief weekly update\" meeting takes zero time. Suggested by Mad Casual.", "Zero-sum game": "A situation where if one person wins, someone else must lose.", "Zero-zero split": "The opportunity to waste time when working on two projects simultaneously by telling one boss that you're busy with the other.", "Zerotasking": "Doing nothing.", "Zombie project": "A project that keeps coming back to life no matter how many times that it's terminated.Suggested by Greg."}